MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1783/mcu.h
extern volatile CLKRCONbits_t CLKRCONbits __at(0x51A);
// bitfield macros
#define _CLKRCON_CLKRDIV0_POSN                              0x0
#define _CLKRCON_CLKRDIV0_POSITION                          0x0
#define _CLKRCON_CLKRDIV0_SIZE                              0x1
#define _CLKRCON_CLKRDIV0_LENGTH                            0x1
#define _CLKRCON_CLKRDIV0_MASK                              0x1
#define _CLKRCON_CLKRDIV1_POSN                              0x1
#define _CLKRCON_CLKRDIV1_POSITION                          0x1
#define _CLKRCON_CLKRDIV1_SIZE                              0x1
#define _CLKRCON_CLKRDIV1_LENGTH                            0x1
#define _CLKRCON_CLKRDIV1_MASK                              0x2
#define _CLKRCON_CLKRDIV2_POSN                              0x2
#define _CLKRCON_CLKRDIV2_POSITION                          0x2
#define _CLKRCON_CLKRDIV2_SIZE                              0x1
#define _CLKRCON_CLKRDIV2_LENGTH                            0x1
#define _CLKRCON_CLKRDIV2_MASK                              0x4
#define _CLKRCON_CLKRDC0_POSN                               0x3
#define _CLKRCON_CLKRDC0_POSITION                           0x3
#define _CLKRCON_CLKRDC0_SIZE                               0x1
#define _CLKRCON_CLKRDC0_LENGTH                             0x1
#define _CLKRCON_CLKRDC0_MASK                               0x8
#define _CLKRCON_CLKRDC1_POSN                               0x4
#define _CLKRCON_CLKRDC1_POSITION                           0x4
#define _CLKRCON_CLKRDC1_SIZE                               0x1
#define _CLKRCON_CLKRDC1_LENGTH                             0x1
#define _CLKRCON_CLKRDC1_MASK                               0x10
#define _CLKRCON_CLKRSLR_POSN                               0x5
#define _CLKRCON_CLKRSLR_POSITION                           0x5
#define _CLKRCON_CLKRSLR_SIZE                               0x1
#define _CLKRCON_CLKRSLR_LENGTH                             0x1
#define _CLKRCON_CLKRSLR_MASK                               0x20
#define _CLKRCON_CLKROE_POSN                                0x6
#define _CLKRCON_CLKROE_POSITION                            0x6
#define _CLKRCON_CLKROE_SIZE                                0x1
#define _CLKRCON_CLKROE_LENGTH                              0x1
#define _CLKRCON_CLKROE_MASK                                0x40
#define _CLKRCON_CLKREN_POSN                                0x7
#define _CLKRCON_CLKREN_POSITION                            0x7
#define _CLKRCON_CLKREN_SIZE                                0x1
#define _CLKRCON_CLKREN_LENGTH                              0x1
#define _CLKRCON_CLKREN_MASK                                0x80
#define _CLKRCON_CLKRDIV_POSN                               0x0
#define _CLKRCON_CLKRDIV_POSITION                           0x0
#define _CLKRCON_CLKRDIV_SIZE                               0x3
#define _CLKRCON_CLKRDIV_LENGTH                             0x3
#define _CLKRCON_CLKRDIV_MASK                               0x7
#define _CLKRCON_CLKRDC_POSN                                0x3
#define _CLKRCON_CLKRDC_POSITION                            0x3
#define _CLKRCON_CLKRDC_SIZE                                0x2
#define _CLKRCON_CLKRDC_LENGTH                              0x2
#define _CLKRCON_CLKRDC_MASK                                0x18

// Register: PSMC1CON
#define PSMC1CON PSMC1CON
extern volatile unsigned char           PSMC1CON            __at(0x811);
#ifndef _LIB_BUILD
asm("PSMC1CON equ 0811h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1MODE                 :4;
        unsigned P1DBRE                 :1;
        unsigned P1DBFE                 :1;
        unsigned PSMC1LD                :1;
        unsigned PSMC1EN                :1;
    };
    struct {
        unsigned P1MODE0                :1;
        unsigned P1MODE1                :1;
        unsigned P1MODE2                :1;
        unsigned P1MODE3                :1;
    };
} PSMC1CONbits_t;
extern volatile PSMC1CONbits_t PSMC1CONbits __at(0x811);
// bitfield macros
#define _PSMC1CON_P1MODE_POSN                               0x0
#define _PSMC1CON_P1MODE_POSITION                           0x0
#define _PSMC1CON_P1MODE_SIZE                               0x4
#define _PSMC1CON_P1MODE_LENGTH                             0x4
#define _PSMC1CON_P1MODE_MASK                               0xF
#define _PSMC1CON_P1DBRE_POSN                               0x4
#define _PSMC1CON_P1DBRE_POSITION                           0x4
#define _PSMC1CON_P1DBRE_SIZE                               0x1
#define _PSMC1CON_P1DBRE_LENGTH                             0x1
#define _PSMC1CON_P1DBRE_MASK                               0x10
#define _PSMC1CON_P1DBFE_POSN                               0x5
#define _PSMC1CON_P1DBFE_POSITION                           0x5
#define _PSMC1CON_P1DBFE_SIZE                               0x1
#define _PSMC1CON_P1DBFE_LENGTH                             0x1
#define _PSMC1CON_P1DBFE_MASK                               0x20
#define _PSMC1CON_PSMC1LD_POSN                              0x6
#define _PSMC1CON_PSMC1LD_POSITION                          0x6
#define _PSMC1CON_PSMC1LD_SIZE                              0x1
#define _PSMC1CON_PSMC1LD_LENGTH                            0x1
#define _PSMC1CON_PSMC1LD_MASK                              0x40
#define _PSMC1CON_PSMC1EN_POSN                              0x7
#define _PSMC1CON_PSMC1EN_POSITION                          0x7
#define _PSMC1CON_PSMC1EN_SIZE                              0x1
#define _PSMC1CON_PSMC1EN_LENGTH                            0x1
#define _PSMC1CON_PSMC1EN_MASK                              0x80
#define _PSMC1CON_P1MODE0_POSN                              0x0
#define _PSMC1CON_P1MODE0_POSITION                          0x0
#define _PSMC1CON_P1MODE0_SIZE                              0x1
#define _PSMC1CON_P1MODE0_LENGTH                            0x1
#define _PSMC1CON_P1MODE0_MASK                              0x1
#define _PSMC1CON_P1MODE1_POSN                              0x1
#define _PSMC1CON_P1MODE1_POSITION                          0x1
#define _PSMC1CON_P1MODE1_SIZE                              0x1
#define _PSMC1CON_P1MODE1_LENGTH                            0x1
#define _PSMC1CON_P1MODE1_MASK                              0x2
#define _PSMC1CON_P1MODE2_POSN                              0x2
#define _PSMC1CON_P1MODE2_POSITION                          0x2
#define _PSMC1CON_P1MODE2_SIZE                              0x1
#define _PSMC1CON_P1MODE2_LENGTH                            0x1
#define _PSMC1CON_P1MODE2_MASK                              0x4
#define _PSMC1CON_P1MODE3_POSN                              0x3
#define _PSMC1CON_P1MODE3_POSITION                          0x3
#define _PSMC1CON_P1MODE3_SIZE                              0x1
#define _PSMC1CON_P1MODE3_LENGTH                            0x1
#define _PSMC1CON_P1MODE3_MASK                              0x8

// Register: PSMC1MDL
#define PSMC1MDL PSMC1MDL
extern volatile unsigned char           PSMC1MDL            __at(0x812);
#ifndef _LIB_BUILD
asm("PSMC1MDL equ 0812h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1MSRC                 :4;
        unsigned                        :1;
        unsigned P1MDLBIT               :1;
        unsigned P1MDLPOL               :1;
        unsigned P1MDLEN                :1;
    };
    struct {
        unsigned P1MSRC0                :1;
        unsigned P1MSRC1                :1;
        unsigned P1MSRC2                :1;
        unsigned P1MSRC3                :1;
    };
} PSMC1MDLbits_t;
extern volatile PSMC1MDLbits_t PSMC1MDLbits __at(0x812);
// bitfield macros
#define _PSMC1MDL_P1MSRC_POSN                               0x0
#define _PSMC1MDL_P1MSRC_POSITION                           0x0
#define _PSMC1MDL_P1MSRC_SIZE                               0x4
#define _PSMC1MDL_P1MSRC_LENGTH                             0x4
#define _PSMC1MDL_P1MSRC_MASK                               0xF
#define _PSMC1MDL_P1MDLBIT_POSN                             0x5
#define _PSMC1MDL_P1MDLBIT_POSITION                         0x5
#define _PSMC1MDL_P1MDLBIT_SIZE                             0x1
#define _PSMC1MDL_P1MDLBIT_LENGTH                           0x1
#define _PSMC1MDL_P1MDLBIT_MASK                             0x20
#define _PSMC1MDL_P1MDLPOL_POSN                             0x6
#define _PSMC1MDL_P1MDLPOL_POSITION                         0x6
#define _PSMC1MDL_P1MDLPOL_SIZE                             0x1
#define _PSMC1MDL_P1MDLPOL_LENGTH                           0x1
#define _PSMC1MDL_P1MDLPOL_MASK                             0x40
#define _PSMC1MDL_P1MDLEN_POSN                              0x7
#define _PSMC1MDL_P1MDLEN_POSITION                          0x7
#define _PSMC1MDL_P1MDLEN_SIZE                              0x1
#define _PSMC1MDL_P1MDLEN_LENGTH                            0x1
#define _PSMC1MDL_P1MDLEN_MASK                              0x80
#define _PSMC1MDL_P1MSRC0_POSN                              0x0
#define _PSMC1MDL_P1MSRC0_POSITION                          0x0
#define _PSMC1MDL_P1MSRC0_SIZE                              0x1
#define _PSMC1MDL_P1MSRC0_LENGTH                            0x1
#define _PSMC1MDL_P1MSRC0_MASK                              0x1
#define _PSMC1MDL_P1MSRC1_POSN                              0x1
#define _PSMC1MDL_P1MSRC1_POSITION                          0x1
#define _PSMC1MDL_P1MSRC1_SIZE                              0x1
#define _PSMC1MDL_P1MSRC1_LENGTH                            0x1
#define _PSMC1MDL_P1MSRC1_MASK                              0x2
#define _PSMC1MDL_P1MSRC2_POSN                              0x2
#define _PSMC1MDL_P1MSRC2_POSITION                          0x2
#define _PSMC1MDL_P1MSRC2_SIZE                              0x1
#define _PSMC1MDL_P1MSRC2_LENGTH                            0x1
#define _PSMC1MDL_P1MSRC2_MASK                              0x4
#define _PSMC1MDL_P1MSRC3_POSN                              0x3
#define _PSMC1MDL_P1MSRC3_POSITION                          0x3
#define _PSMC1MDL_P1MSRC3_SIZE                              0x1
#define _PSMC1MDL_P1MSRC3_LENGTH                            0x1
#define _PSMC1MDL_P1MSRC3_MASK                              0x8

// Register: PSMC1SYNC
#define PSMC1SYNC PSMC1SYNC
extern volatile unsigned char           PSMC1SYNC           __at(0x813);
#ifndef _LIB_BUILD
asm("PSMC1SYNC equ 0813h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1SYNC0                :1;
        unsigned P1SYNC1                :1;
    };
} PSMC1SYNCbits_t;
extern volatile PSMC1SYNCbits_t PSMC1SYNCbits __at(0x813);
// bitfield macros
#define _PSMC1SYNC_P1SYNC0_POSN                             0x0
#define _PSMC1SYNC_P1SYNC0_POSITION                         0x0
#define _PSMC1SYNC_P1SYNC0_SIZE                             0x1
#define _PSMC1SYNC_P1SYNC0_LENGTH                           0x1
#define _PSMC1SYNC_P1SYNC0_MASK                             0x1
#define _PSMC1SYNC_P1SYNC1_POSN                             0x1
#define _PSMC1SYNC_P1SYNC1_POSITION                         0x1
#define _PSMC1SYNC_P1SYNC1_SIZE                             0x1
#define _PSMC1SYNC_P1SYNC1_LENGTH                           0x1
#define _PSMC1SYNC_P1SYNC1_MASK                             0x2

// Register: PSMC1CLK
#define PSMC1CLK PSMC1CLK
extern volatile unsigned char           PSMC1CLK            __at(0x814);
#ifndef _LIB_BUILD
asm("PSMC1CLK equ 0814h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1CSRC0                :1;
        unsigned P1CSRC1                :1;
        unsigned                        :2;
        unsigned P1CPRE0                :1;
        unsigned P1CPRE1                :1;
    };
    struct {
        unsigned P1CSRC                 :2;
        unsigned                        :2;
        unsigned P1CPRE                 :2;
    };
} PSMC1CLKbits_t;
extern volatile PSMC1CLKbits_t PSMC1CLKbits __at(0x814);
// bitfield macros
#define _PSMC1CLK_P1CSRC0_POSN                              0x0
#define _PSMC1CLK_P1CSRC0_POSITION                          0x0
#define _PSMC1CLK_P1CSRC0_SIZE                              0x1
#define _PSMC1CLK_P1CSRC0_LENGTH                            0x1
#define _PSMC1CLK_P1CSRC0_MASK                              0x1
#define _PSMC1CLK_P1CSRC1_POSN                              0x1
#define _PSMC1CLK_P1CSRC1_POSITION                          0x1
#define _PSMC1CLK_P1CSRC1_SIZE                              0x1
#define _PSMC1CLK_P1CSRC1_LENGTH                            0x1
#define _PSMC1CLK_P1CSRC1_MASK                              0x2
#define _PSMC1CLK_P1CPRE0_POSN                              0x4
#define _PSMC1CLK_P1CPRE0_POSITION                          0x4
#define _PSMC1CLK_P1CPRE0_SIZE                              0x1
#define _PSMC1CLK_P1CPRE0_LENGTH                            0x1
#define _PSMC1CLK_P1CPRE0_MASK                              0x10
#define _PSMC1CLK_P1CPRE1_POSN                              0x5
#define _PSMC1CLK_P1CPRE1_POSITION                          0x5
#define _PSMC1CLK_P1CPRE1_SIZE                              0x1
#define _PSMC1CLK_P1CPRE1_LENGTH                            0x1
#define _PSMC1CLK_P1CPRE1_MASK                              0x20
#define _PSMC1CLK_P1CSRC_POSN                               0x0
#define _PSMC1CLK_P1CSRC_POSITION                           0x0
#define _PSMC1CLK_P1CSRC_SIZE                               0x2
#define _PSMC1CLK_P1CSRC_LENGTH                             0x2
#define _PSMC1CLK_P1CSRC_MASK                               0x3
#define _PSMC1CLK_P1CPRE_POSN                               0x4
#define _PSMC1CLK_P1CPRE_POSITION                           0x4
#define _PSMC1CLK_P1CPRE_SIZE                               0x2
#define _PSMC1CLK_P1CPRE_LENGTH                             0x2
#define _PSMC1CLK_P1CPRE_MASK                               0x30

// Register: PSMC1OEN
#define PSMC1OEN PSMC1OEN
extern volatile unsigned char           PSMC1OEN            __at(0x815);
#ifndef _LIB_BUILD
asm("PSMC1OEN equ 0815h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1OEA                  :1;
        unsigned P1OEB                  :1;
        unsigned P1OEC                  :1;
        unsigned P1OED                  :1;
        unsigned P1OEE                  :1;
        unsigned P1OEF                  :1;
    };
} PSMC1OENbits_t;
extern volatile PSMC1OENbits_t PSMC1OENbits __at(0x815);
// bitfield macros
#define _PSMC1OEN_P1OEA_POSN                                0x0
#define _PSMC1OEN_P1OEA_POSITION                            0x0
#define _PSMC1OEN_P1OEA_SIZE                                0x1
#define _PSMC1OEN_P1OEA_LENGTH                              0x1
#define _PSMC1OEN_P1OEA_MASK                                0x1
#define _PSMC1OEN_P1OEB_POSN                                0x1
#define _PSMC1OEN_P1OEB_POSITION                            0x1
#define _PSMC1OEN_P1OEB_SIZE                                0x1
#define _PSMC1OEN_P1OEB_LENGTH                              0x1
#define _PSMC1OEN_P1OEB_MASK                                0x2
#define _PSMC1OEN_P1OEC_POSN                                0x2
#define _PSMC1OEN_P1OEC_POSITION                            0x2
#define _PSMC1OEN_P1OEC_SIZE                                0x1
#define _PSMC1OEN_P1OEC_LENGTH                              0x1
#define _PSMC1OEN_P1OEC_MASK                                0x4
#define _PSMC1OEN_P1OED_POSN                                0x3
#define _PSMC1OEN_P1OED_POSITION                            0x3
#define _PSMC1OEN_P1OED_SIZE                                0x1
#define _PSMC1OEN_P1OED_LENGTH                              0x1
#define _PSMC1OEN_P1OED_MASK                                0x8
#define _PSMC1OEN_P1OEE_POSN                                0x4
#define _PSMC1OEN_P1OEE_POSITION                            0x4
#define _PSMC1OEN_P1OEE_SIZE                                0x1
#define _PSMC1OEN_P1OEE_LENGTH                              0x1
#define _PSMC1OEN_P1OEE_MASK                                0x10
#define _PSMC1OEN_P1OEF_POSN                                0x5
#define _PSMC1OEN_P1OEF_POSITION                            0x5
#define _PSMC1OEN_P1OEF_SIZE                                0x1
#define _PSMC1OEN_P1OEF_LENGTH                              0x1
#define _PSMC1OEN_P1OEF_MASK                                0x20

// Register: PSMC1POL
#define PSMC1POL PSMC1POL
extern volatile unsigned char           PSMC1POL            __at(0x816);
#ifndef _LIB_BUILD
asm("PSMC1POL equ 0816h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1POLA                 :1;
        unsigned P1POLB                 :1;
        unsigned P1POLC                 :1;
        unsigned P1POLD                 :1;
        unsigned P1POLE                 :1;
        unsigned P1POLF                 :1;
        unsigned P1INPOL                :1;
    };
} PSMC1POLbits_t;
extern volatile PSMC1POLbits_t PSMC1POLbits __at(0x816);
// bitfield macros
#define _PSMC1POL_P1POLA_POSN                               0x0
#define _PSMC1POL_P1POLA_POSITION                           0x0
#define _PSMC1POL_P1POLA_SIZE                               0x1
#define _PSMC1POL_P1POLA_LENGTH                             0x1
#define _PSMC1POL_P1POLA_MASK                               0x1
#define _PSMC1POL_P1POLB_POSN                               0x1
#define _PSMC1POL_P1POLB_POSITION                           0x1
#define _PSMC1POL_P1POLB_SIZE                               0x1
#define _PSMC1POL_P1POLB_LENGTH                             0x1
#define _PSMC1POL_P1POLB_MASK                               0x2
#define _PSMC1POL_P1POLC_POSN                               0x2
#define _PSMC1POL_P1POLC_POSITION                           0x2
#define _PSMC1POL_P1POLC_SIZE                               0x1
#define _PSMC1POL_P1POLC_LENGTH                             0x1
#define _PSMC1POL_P1POLC_MASK                               0x4
#define _PSMC1POL_P1POLD_POSN                               0x3
#define _PSMC1POL_P1POLD_POSITION                           0x3
#define _PSMC1POL_P1POLD_SIZE                               0x1
#define _PSMC1POL_P1POLD_LENGTH                             0x1
#define _PSMC1POL_P1POLD_MASK                               0x8
#define _PSMC1POL_P1POLE_POSN                               0x4
#define _PSMC1POL_P1POLE_POSITION                           0x4
#define _PSMC1POL_P1POLE_SIZE                               0x1
#define _PSMC1POL_P1POLE_LENGTH                             0x1
#define _PSMC1POL_P1POLE_MASK                               0x10
#define _PSMC1POL_P1POLF_POSN                               0x5
#define _PSMC1POL_P1POLF_POSITION                           0x5
#define _PSMC1POL_P1POLF_SIZE                               0x1
#define _PSMC1POL_P1POLF_LENGTH                             0x1
#define _PSMC1POL_P1POLF_MASK                               0x20
#define _PSMC1POL_P1INPOL_POSN                              0x6
#define _PSMC1POL_P1INPOL_POSITION                          0x6
#define _PSMC1POL_P1INPOL_SIZE                              0x1
#define _PSMC1POL_P1INPOL_LENGTH                            0x1
#define _PSMC1POL_P1INPOL_MASK                              0x40

