MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1783/mcu.h
// Register: PSMC1BLNK
#define PSMC1BLNK PSMC1BLNK
extern volatile unsigned char           PSMC1BLNK           __at(0x817);
#ifndef _LIB_BUILD
asm("PSMC1BLNK equ 0817h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1REBM                 :2;
        unsigned                        :2;
        unsigned P1FEBM                 :2;
    };
    struct {
        unsigned P1REBM0                :1;
        unsigned P1REBM1                :1;
        unsigned                        :2;
        unsigned P1FEBM0                :1;
        unsigned P1FEBM1                :1;
    };
} PSMC1BLNKbits_t;
extern volatile PSMC1BLNKbits_t PSMC1BLNKbits __at(0x817);
// bitfield macros
#define _PSMC1BLNK_P1REBM_POSN                              0x0
#define _PSMC1BLNK_P1REBM_POSITION                          0x0
#define _PSMC1BLNK_P1REBM_SIZE                              0x2
#define _PSMC1BLNK_P1REBM_LENGTH                            0x2
#define _PSMC1BLNK_P1REBM_MASK                              0x3
#define _PSMC1BLNK_P1FEBM_POSN                              0x4
#define _PSMC1BLNK_P1FEBM_POSITION                          0x4
#define _PSMC1BLNK_P1FEBM_SIZE                              0x2
#define _PSMC1BLNK_P1FEBM_LENGTH                            0x2
#define _PSMC1BLNK_P1FEBM_MASK                              0x30
#define _PSMC1BLNK_P1REBM0_POSN                             0x0
#define _PSMC1BLNK_P1REBM0_POSITION                         0x0
#define _PSMC1BLNK_P1REBM0_SIZE                             0x1
#define _PSMC1BLNK_P1REBM0_LENGTH                           0x1
#define _PSMC1BLNK_P1REBM0_MASK                             0x1
#define _PSMC1BLNK_P1REBM1_POSN                             0x1
#define _PSMC1BLNK_P1REBM1_POSITION                         0x1
#define _PSMC1BLNK_P1REBM1_SIZE                             0x1
#define _PSMC1BLNK_P1REBM1_LENGTH                           0x1
#define _PSMC1BLNK_P1REBM1_MASK                             0x2
#define _PSMC1BLNK_P1FEBM0_POSN                             0x4
#define _PSMC1BLNK_P1FEBM0_POSITION                         0x4
#define _PSMC1BLNK_P1FEBM0_SIZE                             0x1
#define _PSMC1BLNK_P1FEBM0_LENGTH                           0x1
#define _PSMC1BLNK_P1FEBM0_MASK                             0x10
#define _PSMC1BLNK_P1FEBM1_POSN                             0x5
#define _PSMC1BLNK_P1FEBM1_POSITION                         0x5
#define _PSMC1BLNK_P1FEBM1_SIZE                             0x1
#define _PSMC1BLNK_P1FEBM1_LENGTH                           0x1
#define _PSMC1BLNK_P1FEBM1_MASK                             0x20

// Register: PSMC1REBS
#define PSMC1REBS PSMC1REBS
extern volatile unsigned char           PSMC1REBS           __at(0x818);
#ifndef _LIB_BUILD
asm("PSMC1REBS equ 0818h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P1REBSC1               :1;
        unsigned P1REBSC2               :1;
        unsigned P1REBSC3               :1;
        unsigned                        :3;
        unsigned P1REBSIN               :1;
    };
} PSMC1REBSbits_t;
extern volatile PSMC1REBSbits_t PSMC1REBSbits __at(0x818);
// bitfield macros
#define _PSMC1REBS_P1REBSC1_POSN                            0x1
#define _PSMC1REBS_P1REBSC1_POSITION                        0x1
#define _PSMC1REBS_P1REBSC1_SIZE                            0x1
#define _PSMC1REBS_P1REBSC1_LENGTH                          0x1
#define _PSMC1REBS_P1REBSC1_MASK                            0x2
#define _PSMC1REBS_P1REBSC2_POSN                            0x2
#define _PSMC1REBS_P1REBSC2_POSITION                        0x2
#define _PSMC1REBS_P1REBSC2_SIZE                            0x1
#define _PSMC1REBS_P1REBSC2_LENGTH                          0x1
#define _PSMC1REBS_P1REBSC2_MASK                            0x4
#define _PSMC1REBS_P1REBSC3_POSN                            0x3
#define _PSMC1REBS_P1REBSC3_POSITION                        0x3
#define _PSMC1REBS_P1REBSC3_SIZE                            0x1
#define _PSMC1REBS_P1REBSC3_LENGTH                          0x1
#define _PSMC1REBS_P1REBSC3_MASK                            0x8
#define _PSMC1REBS_P1REBSIN_POSN                            0x7
#define _PSMC1REBS_P1REBSIN_POSITION                        0x7
#define _PSMC1REBS_P1REBSIN_SIZE                            0x1
#define _PSMC1REBS_P1REBSIN_LENGTH                          0x1
#define _PSMC1REBS_P1REBSIN_MASK                            0x80

// Register: PSMC1FEBS
#define PSMC1FEBS PSMC1FEBS
extern volatile unsigned char           PSMC1FEBS           __at(0x819);
#ifndef _LIB_BUILD
asm("PSMC1FEBS equ 0819h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P1FEBSC1               :1;
        unsigned P1FEBSC2               :1;
        unsigned P1FEBSC3               :1;
        unsigned                        :3;
        unsigned P1FEBSIN               :1;
    };
} PSMC1FEBSbits_t;
extern volatile PSMC1FEBSbits_t PSMC1FEBSbits __at(0x819);
// bitfield macros
#define _PSMC1FEBS_P1FEBSC1_POSN                            0x1
#define _PSMC1FEBS_P1FEBSC1_POSITION                        0x1
#define _PSMC1FEBS_P1FEBSC1_SIZE                            0x1
#define _PSMC1FEBS_P1FEBSC1_LENGTH                          0x1
#define _PSMC1FEBS_P1FEBSC1_MASK                            0x2
#define _PSMC1FEBS_P1FEBSC2_POSN                            0x2
#define _PSMC1FEBS_P1FEBSC2_POSITION                        0x2
#define _PSMC1FEBS_P1FEBSC2_SIZE                            0x1
#define _PSMC1FEBS_P1FEBSC2_LENGTH                          0x1
#define _PSMC1FEBS_P1FEBSC2_MASK                            0x4
#define _PSMC1FEBS_P1FEBSC3_POSN                            0x3
#define _PSMC1FEBS_P1FEBSC3_POSITION                        0x3
#define _PSMC1FEBS_P1FEBSC3_SIZE                            0x1
#define _PSMC1FEBS_P1FEBSC3_LENGTH                          0x1
#define _PSMC1FEBS_P1FEBSC3_MASK                            0x8
#define _PSMC1FEBS_P1FEBSIN_POSN                            0x7
#define _PSMC1FEBS_P1FEBSIN_POSITION                        0x7
#define _PSMC1FEBS_P1FEBSIN_SIZE                            0x1
#define _PSMC1FEBS_P1FEBSIN_LENGTH                          0x1
#define _PSMC1FEBS_P1FEBSIN_MASK                            0x80

