MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1783/mcu.h
// Register: PSMC2MDL
#define PSMC2MDL PSMC2MDL
extern volatile unsigned char           PSMC2MDL            __at(0x832);
#ifndef _LIB_BUILD
asm("PSMC2MDL equ 0832h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2MSRC                 :4;
        unsigned                        :1;
        unsigned P2MDLBIT               :1;
        unsigned P2MDLPOL               :1;
        unsigned P2MDLEN                :1;
    };
    struct {
        unsigned P2MSRC0                :1;
        unsigned P2MSRC1                :1;
        unsigned P2MSRC2                :1;
        unsigned P2MSRC3                :1;
    };
} PSMC2MDLbits_t;
extern volatile PSMC2MDLbits_t PSMC2MDLbits __at(0x832);
// bitfield macros
#define _PSMC2MDL_P2MSRC_POSN                               0x0
#define _PSMC2MDL_P2MSRC_POSITION                           0x0
#define _PSMC2MDL_P2MSRC_SIZE                               0x4
#define _PSMC2MDL_P2MSRC_LENGTH                             0x4
#define _PSMC2MDL_P2MSRC_MASK                               0xF
#define _PSMC2MDL_P2MDLBIT_POSN                             0x5
#define _PSMC2MDL_P2MDLBIT_POSITION                         0x5
#define _PSMC2MDL_P2MDLBIT_SIZE                             0x1
#define _PSMC2MDL_P2MDLBIT_LENGTH                           0x1
#define _PSMC2MDL_P2MDLBIT_MASK                             0x20
#define _PSMC2MDL_P2MDLPOL_POSN                             0x6
#define _PSMC2MDL_P2MDLPOL_POSITION                         0x6
#define _PSMC2MDL_P2MDLPOL_SIZE                             0x1
#define _PSMC2MDL_P2MDLPOL_LENGTH                           0x1
#define _PSMC2MDL_P2MDLPOL_MASK                             0x40
#define _PSMC2MDL_P2MDLEN_POSN                              0x7
#define _PSMC2MDL_P2MDLEN_POSITION                          0x7
#define _PSMC2MDL_P2MDLEN_SIZE                              0x1
#define _PSMC2MDL_P2MDLEN_LENGTH                            0x1
#define _PSMC2MDL_P2MDLEN_MASK                              0x80
#define _PSMC2MDL_P2MSRC0_POSN                              0x0
#define _PSMC2MDL_P2MSRC0_POSITION                          0x0
#define _PSMC2MDL_P2MSRC0_SIZE                              0x1
#define _PSMC2MDL_P2MSRC0_LENGTH                            0x1
#define _PSMC2MDL_P2MSRC0_MASK                              0x1
#define _PSMC2MDL_P2MSRC1_POSN                              0x1
#define _PSMC2MDL_P2MSRC1_POSITION                          0x1
#define _PSMC2MDL_P2MSRC1_SIZE                              0x1
#define _PSMC2MDL_P2MSRC1_LENGTH                            0x1
#define _PSMC2MDL_P2MSRC1_MASK                              0x2
#define _PSMC2MDL_P2MSRC2_POSN                              0x2
#define _PSMC2MDL_P2MSRC2_POSITION                          0x2
#define _PSMC2MDL_P2MSRC2_SIZE                              0x1
#define _PSMC2MDL_P2MSRC2_LENGTH                            0x1
#define _PSMC2MDL_P2MSRC2_MASK                              0x4
#define _PSMC2MDL_P2MSRC3_POSN                              0x3
#define _PSMC2MDL_P2MSRC3_POSITION                          0x3
#define _PSMC2MDL_P2MSRC3_SIZE                              0x1
#define _PSMC2MDL_P2MSRC3_LENGTH                            0x1
#define _PSMC2MDL_P2MSRC3_MASK                              0x8

// Register: PSMC2SYNC
#define PSMC2SYNC PSMC2SYNC
extern volatile unsigned char           PSMC2SYNC           __at(0x833);
#ifndef _LIB_BUILD
asm("PSMC2SYNC equ 0833h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2SYNC0                :1;
        unsigned P2SYNC1                :1;
    };
} PSMC2SYNCbits_t;
extern volatile PSMC2SYNCbits_t PSMC2SYNCbits __at(0x833);
// bitfield macros
#define _PSMC2SYNC_P2SYNC0_POSN                             0x0
#define _PSMC2SYNC_P2SYNC0_POSITION                         0x0
#define _PSMC2SYNC_P2SYNC0_SIZE                             0x1
#define _PSMC2SYNC_P2SYNC0_LENGTH                           0x1
#define _PSMC2SYNC_P2SYNC0_MASK                             0x1
#define _PSMC2SYNC_P2SYNC1_POSN                             0x1
#define _PSMC2SYNC_P2SYNC1_POSITION                         0x1
#define _PSMC2SYNC_P2SYNC1_SIZE                             0x1
#define _PSMC2SYNC_P2SYNC1_LENGTH                           0x1
#define _PSMC2SYNC_P2SYNC1_MASK                             0x2

// Register: PSMC2CLK
#define PSMC2CLK PSMC2CLK
extern volatile unsigned char           PSMC2CLK            __at(0x834);
#ifndef _LIB_BUILD
asm("PSMC2CLK equ 0834h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2CSRC0                :1;
        unsigned P2CSRC1                :1;
        unsigned                        :2;
        unsigned P2CPRE0                :1;
        unsigned P2CPRE1                :1;
    };
    struct {
        unsigned P2CSRC                 :2;
        unsigned                        :2;
        unsigned P2CPRE                 :2;
    };
} PSMC2CLKbits_t;
extern volatile PSMC2CLKbits_t PSMC2CLKbits __at(0x834);
// bitfield macros
#define _PSMC2CLK_P2CSRC0_POSN                              0x0
#define _PSMC2CLK_P2CSRC0_POSITION                          0x0
#define _PSMC2CLK_P2CSRC0_SIZE                              0x1
#define _PSMC2CLK_P2CSRC0_LENGTH                            0x1
#define _PSMC2CLK_P2CSRC0_MASK                              0x1
#define _PSMC2CLK_P2CSRC1_POSN                              0x1
#define _PSMC2CLK_P2CSRC1_POSITION                          0x1
#define _PSMC2CLK_P2CSRC1_SIZE                              0x1
#define _PSMC2CLK_P2CSRC1_LENGTH                            0x1
#define _PSMC2CLK_P2CSRC1_MASK                              0x2
#define _PSMC2CLK_P2CPRE0_POSN                              0x4
#define _PSMC2CLK_P2CPRE0_POSITION                          0x4
#define _PSMC2CLK_P2CPRE0_SIZE                              0x1
#define _PSMC2CLK_P2CPRE0_LENGTH                            0x1
#define _PSMC2CLK_P2CPRE0_MASK                              0x10
#define _PSMC2CLK_P2CPRE1_POSN                              0x5
#define _PSMC2CLK_P2CPRE1_POSITION                          0x5
#define _PSMC2CLK_P2CPRE1_SIZE                              0x1
#define _PSMC2CLK_P2CPRE1_LENGTH                            0x1
#define _PSMC2CLK_P2CPRE1_MASK                              0x20
#define _PSMC2CLK_P2CSRC_POSN                               0x0
#define _PSMC2CLK_P2CSRC_POSITION                           0x0
#define _PSMC2CLK_P2CSRC_SIZE                               0x2
#define _PSMC2CLK_P2CSRC_LENGTH                             0x2
#define _PSMC2CLK_P2CSRC_MASK                               0x3
#define _PSMC2CLK_P2CPRE_POSN                               0x4
#define _PSMC2CLK_P2CPRE_POSITION                           0x4
#define _PSMC2CLK_P2CPRE_SIZE                               0x2
#define _PSMC2CLK_P2CPRE_LENGTH                             0x2
#define _PSMC2CLK_P2CPRE_MASK                               0x30

// Register: PSMC2OEN
#define PSMC2OEN PSMC2OEN
extern volatile unsigned char           PSMC2OEN            __at(0x835);
#ifndef _LIB_BUILD
asm("PSMC2OEN equ 0835h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2OEA                  :1;
        unsigned P2OEB                  :1;
    };
} PSMC2OENbits_t;
