MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1783/mcu.h
extern volatile PSMC2PRSbits_t PSMC2PRSbits __at(0x83C);
// bitfield macros
#define _PSMC2PRS_P2PRST_POSN                               0x0
#define _PSMC2PRS_P2PRST_POSITION                           0x0
#define _PSMC2PRS_P2PRST_SIZE                               0x1
#define _PSMC2PRS_P2PRST_LENGTH                             0x1
#define _PSMC2PRS_P2PRST_MASK                               0x1
#define _PSMC2PRS_P2PRSC1_POSN                              0x1
#define _PSMC2PRS_P2PRSC1_POSITION                          0x1
#define _PSMC2PRS_P2PRSC1_SIZE                              0x1
#define _PSMC2PRS_P2PRSC1_LENGTH                            0x1
#define _PSMC2PRS_P2PRSC1_MASK                              0x2
#define _PSMC2PRS_P2PRSC2_POSN                              0x2
#define _PSMC2PRS_P2PRSC2_POSITION                          0x2
#define _PSMC2PRS_P2PRSC2_SIZE                              0x1
#define _PSMC2PRS_P2PRSC2_LENGTH                            0x1
#define _PSMC2PRS_P2PRSC2_MASK                              0x4
#define _PSMC2PRS_P2PRSC3_POSN                              0x3
#define _PSMC2PRS_P2PRSC3_POSITION                          0x3
#define _PSMC2PRS_P2PRSC3_SIZE                              0x1
#define _PSMC2PRS_P2PRSC3_LENGTH                            0x1
#define _PSMC2PRS_P2PRSC3_MASK                              0x8
#define _PSMC2PRS_P2PRSIN_POSN                              0x7
#define _PSMC2PRS_P2PRSIN_POSITION                          0x7
#define _PSMC2PRS_P2PRSIN_SIZE                              0x1
#define _PSMC2PRS_P2PRSIN_LENGTH                            0x1
#define _PSMC2PRS_P2PRSIN_MASK                              0x80

// Register: PSMC2ASDC
#define PSMC2ASDC PSMC2ASDC
extern volatile unsigned char           PSMC2ASDC           __at(0x83D);
#ifndef _LIB_BUILD
asm("PSMC2ASDC equ 083Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2ASDOV                :1;
        unsigned                        :4;
        unsigned P2ARSEN                :1;
        unsigned P2ASDEN                :1;
        unsigned P2ASE                  :1;
    };
} PSMC2ASDCbits_t;
extern volatile PSMC2ASDCbits_t PSMC2ASDCbits __at(0x83D);
// bitfield macros
#define _PSMC2ASDC_P2ASDOV_POSN                             0x0
#define _PSMC2ASDC_P2ASDOV_POSITION                         0x0
#define _PSMC2ASDC_P2ASDOV_SIZE                             0x1
#define _PSMC2ASDC_P2ASDOV_LENGTH                           0x1
#define _PSMC2ASDC_P2ASDOV_MASK                             0x1
#define _PSMC2ASDC_P2ARSEN_POSN                             0x5
#define _PSMC2ASDC_P2ARSEN_POSITION                         0x5
#define _PSMC2ASDC_P2ARSEN_SIZE                             0x1
#define _PSMC2ASDC_P2ARSEN_LENGTH                           0x1
#define _PSMC2ASDC_P2ARSEN_MASK                             0x20
#define _PSMC2ASDC_P2ASDEN_POSN                             0x6
#define _PSMC2ASDC_P2ASDEN_POSITION                         0x6
#define _PSMC2ASDC_P2ASDEN_SIZE                             0x1
#define _PSMC2ASDC_P2ASDEN_LENGTH                           0x1
#define _PSMC2ASDC_P2ASDEN_MASK                             0x40
#define _PSMC2ASDC_P2ASE_POSN                               0x7
#define _PSMC2ASDC_P2ASE_POSITION                           0x7
#define _PSMC2ASDC_P2ASE_SIZE                               0x1
#define _PSMC2ASDC_P2ASE_LENGTH                             0x1
#define _PSMC2ASDC_P2ASE_MASK                               0x80

// Register: PSMC2ASDL
#define PSMC2ASDL PSMC2ASDL
extern volatile unsigned char           PSMC2ASDL           __at(0x83E);
#ifndef _LIB_BUILD
asm("PSMC2ASDL equ 083Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2ASDLA                :1;
        unsigned P2ASDLB                :1;
    };
} PSMC2ASDLbits_t;
extern volatile PSMC2ASDLbits_t PSMC2ASDLbits __at(0x83E);
// bitfield macros
#define _PSMC2ASDL_P2ASDLA_POSN                             0x0
#define _PSMC2ASDL_P2ASDLA_POSITION                         0x0
#define _PSMC2ASDL_P2ASDLA_SIZE                             0x1
#define _PSMC2ASDL_P2ASDLA_LENGTH                           0x1
#define _PSMC2ASDL_P2ASDLA_MASK                             0x1
#define _PSMC2ASDL_P2ASDLB_POSN                             0x1
#define _PSMC2ASDL_P2ASDLB_POSITION                         0x1
#define _PSMC2ASDL_P2ASDLB_SIZE                             0x1
#define _PSMC2ASDL_P2ASDLB_LENGTH                           0x1
#define _PSMC2ASDL_P2ASDLB_MASK                             0x2

// Register: PSMC2ASDS
#define PSMC2ASDS PSMC2ASDS
extern volatile unsigned char           PSMC2ASDS           __at(0x83F);
#ifndef _LIB_BUILD
asm("PSMC2ASDS equ 083Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned P2ASDSC1               :1;
        unsigned P2ASDSC2               :1;
        unsigned P2ASDSC3               :1;
        unsigned                        :3;
        unsigned P2ASDSIN               :1;
    };
} PSMC2ASDSbits_t;
extern volatile PSMC2ASDSbits_t PSMC2ASDSbits __at(0x83F);
// bitfield macros
#define _PSMC2ASDS_P2ASDSC1_POSN                            0x1
#define _PSMC2ASDS_P2ASDSC1_POSITION                        0x1
#define _PSMC2ASDS_P2ASDSC1_SIZE                            0x1
#define _PSMC2ASDS_P2ASDSC1_LENGTH                          0x1
#define _PSMC2ASDS_P2ASDSC1_MASK                            0x2
#define _PSMC2ASDS_P2ASDSC2_POSN                            0x2
#define _PSMC2ASDS_P2ASDSC2_POSITION                        0x2
#define _PSMC2ASDS_P2ASDSC2_SIZE                            0x1
#define _PSMC2ASDS_P2ASDSC2_LENGTH                          0x1
#define _PSMC2ASDS_P2ASDSC2_MASK                            0x4
#define _PSMC2ASDS_P2ASDSC3_POSN                            0x3
#define _PSMC2ASDS_P2ASDSC3_POSITION                        0x3
#define _PSMC2ASDS_P2ASDSC3_SIZE                            0x1
#define _PSMC2ASDS_P2ASDSC3_LENGTH                          0x1
#define _PSMC2ASDS_P2ASDSC3_MASK                            0x8
#define _PSMC2ASDS_P2ASDSIN_POSN                            0x7
#define _PSMC2ASDS_P2ASDSIN_POSITION                        0x7
#define _PSMC2ASDS_P2ASDSIN_SIZE                            0x1
#define _PSMC2ASDS_P2ASDSIN_LENGTH                          0x1
#define _PSMC2ASDS_P2ASDSIN_MASK                            0x80

