MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1783/mcu.h
// Register: PSMC2DCL
#define PSMC2DCL PSMC2DCL
extern volatile unsigned char           PSMC2DCL            __at(0x843);
#ifndef _LIB_BUILD
asm("PSMC2DCL equ 0843h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2DC0               :1;
        unsigned PSMC2DC1               :1;
        unsigned PSMC2DC2               :1;
        unsigned PSMC2DC3               :1;
        unsigned PSMC2DC4               :1;
        unsigned PSMC2DC5               :1;
        unsigned PSMC2DC6               :1;
        unsigned PSMC2DC7               :1;
    };
} PSMC2DCLbits_t;
extern volatile PSMC2DCLbits_t PSMC2DCLbits __at(0x843);
// bitfield macros
#define _PSMC2DCL_PSMC2DC0_POSN                             0x0
#define _PSMC2DCL_PSMC2DC0_POSITION                         0x0
#define _PSMC2DCL_PSMC2DC0_SIZE                             0x1
#define _PSMC2DCL_PSMC2DC0_LENGTH                           0x1
#define _PSMC2DCL_PSMC2DC0_MASK                             0x1
#define _PSMC2DCL_PSMC2DC1_POSN                             0x1
#define _PSMC2DCL_PSMC2DC1_POSITION                         0x1
#define _PSMC2DCL_PSMC2DC1_SIZE                             0x1
#define _PSMC2DCL_PSMC2DC1_LENGTH                           0x1
#define _PSMC2DCL_PSMC2DC1_MASK                             0x2
#define _PSMC2DCL_PSMC2DC2_POSN                             0x2
#define _PSMC2DCL_PSMC2DC2_POSITION                         0x2
#define _PSMC2DCL_PSMC2DC2_SIZE                             0x1
#define _PSMC2DCL_PSMC2DC2_LENGTH                           0x1
#define _PSMC2DCL_PSMC2DC2_MASK                             0x4
#define _PSMC2DCL_PSMC2DC3_POSN                             0x3
#define _PSMC2DCL_PSMC2DC3_POSITION                         0x3
#define _PSMC2DCL_PSMC2DC3_SIZE                             0x1
#define _PSMC2DCL_PSMC2DC3_LENGTH                           0x1
#define _PSMC2DCL_PSMC2DC3_MASK                             0x8
#define _PSMC2DCL_PSMC2DC4_POSN                             0x4
#define _PSMC2DCL_PSMC2DC4_POSITION                         0x4
#define _PSMC2DCL_PSMC2DC4_SIZE                             0x1
#define _PSMC2DCL_PSMC2DC4_LENGTH                           0x1
#define _PSMC2DCL_PSMC2DC4_MASK                             0x10
#define _PSMC2DCL_PSMC2DC5_POSN                             0x5
#define _PSMC2DCL_PSMC2DC5_POSITION                         0x5
#define _PSMC2DCL_PSMC2DC5_SIZE                             0x1
#define _PSMC2DCL_PSMC2DC5_LENGTH                           0x1
#define _PSMC2DCL_PSMC2DC5_MASK                             0x20
#define _PSMC2DCL_PSMC2DC6_POSN                             0x6
#define _PSMC2DCL_PSMC2DC6_POSITION                         0x6
#define _PSMC2DCL_PSMC2DC6_SIZE                             0x1
#define _PSMC2DCL_PSMC2DC6_LENGTH                           0x1
#define _PSMC2DCL_PSMC2DC6_MASK                             0x40
#define _PSMC2DCL_PSMC2DC7_POSN                             0x7
#define _PSMC2DCL_PSMC2DC7_POSITION                         0x7
#define _PSMC2DCL_PSMC2DC7_SIZE                             0x1
#define _PSMC2DCL_PSMC2DC7_LENGTH                           0x1
#define _PSMC2DCL_PSMC2DC7_MASK                             0x80

// Register: PSMC2DCH
#define PSMC2DCH PSMC2DCH
extern volatile unsigned char           PSMC2DCH            __at(0x844);
#ifndef _LIB_BUILD
asm("PSMC2DCH equ 0844h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2DC8               :1;
        unsigned PSMC2DC9               :1;
        unsigned PSMC2DC10              :1;
        unsigned PSMC2DC11              :1;
        unsigned PSMC2DC12              :1;
        unsigned PSMC2DC13              :1;
        unsigned PSMC2DC14              :1;
        unsigned PSMC2DC15              :1;
    };
} PSMC2DCHbits_t;
extern volatile PSMC2DCHbits_t PSMC2DCHbits __at(0x844);
// bitfield macros
#define _PSMC2DCH_PSMC2DC8_POSN                             0x0
#define _PSMC2DCH_PSMC2DC8_POSITION                         0x0
#define _PSMC2DCH_PSMC2DC8_SIZE                             0x1
#define _PSMC2DCH_PSMC2DC8_LENGTH                           0x1
#define _PSMC2DCH_PSMC2DC8_MASK                             0x1
#define _PSMC2DCH_PSMC2DC9_POSN                             0x1
#define _PSMC2DCH_PSMC2DC9_POSITION                         0x1
#define _PSMC2DCH_PSMC2DC9_SIZE                             0x1
#define _PSMC2DCH_PSMC2DC9_LENGTH                           0x1
#define _PSMC2DCH_PSMC2DC9_MASK                             0x2
#define _PSMC2DCH_PSMC2DC10_POSN                            0x2
#define _PSMC2DCH_PSMC2DC10_POSITION                        0x2
#define _PSMC2DCH_PSMC2DC10_SIZE                            0x1
#define _PSMC2DCH_PSMC2DC10_LENGTH                          0x1
#define _PSMC2DCH_PSMC2DC10_MASK                            0x4
#define _PSMC2DCH_PSMC2DC11_POSN                            0x3
#define _PSMC2DCH_PSMC2DC11_POSITION                        0x3
#define _PSMC2DCH_PSMC2DC11_SIZE                            0x1
#define _PSMC2DCH_PSMC2DC11_LENGTH                          0x1
#define _PSMC2DCH_PSMC2DC11_MASK                            0x8
#define _PSMC2DCH_PSMC2DC12_POSN                            0x4
#define _PSMC2DCH_PSMC2DC12_POSITION                        0x4
#define _PSMC2DCH_PSMC2DC12_SIZE                            0x1
#define _PSMC2DCH_PSMC2DC12_LENGTH                          0x1
#define _PSMC2DCH_PSMC2DC12_MASK                            0x10
#define _PSMC2DCH_PSMC2DC13_POSN                            0x5
#define _PSMC2DCH_PSMC2DC13_POSITION                        0x5
#define _PSMC2DCH_PSMC2DC13_SIZE                            0x1
#define _PSMC2DCH_PSMC2DC13_LENGTH                          0x1
#define _PSMC2DCH_PSMC2DC13_MASK                            0x20
#define _PSMC2DCH_PSMC2DC14_POSN                            0x6
#define _PSMC2DCH_PSMC2DC14_POSITION                        0x6
#define _PSMC2DCH_PSMC2DC14_SIZE                            0x1
#define _PSMC2DCH_PSMC2DC14_LENGTH                          0x1
#define _PSMC2DCH_PSMC2DC14_MASK                            0x40
#define _PSMC2DCH_PSMC2DC15_POSN                            0x7
#define _PSMC2DCH_PSMC2DC15_POSITION                        0x7
#define _PSMC2DCH_PSMC2DC15_SIZE                            0x1
#define _PSMC2DCH_PSMC2DC15_LENGTH                          0x1
#define _PSMC2DCH_PSMC2DC15_MASK                            0x80

// Register: PSMC2PR
#define PSMC2PR PSMC2PR
extern volatile unsigned short          PSMC2PR             __at(0x845);
#ifndef _LIB_BUILD
asm("PSMC2PR equ 0845h");
#endif

