MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1783/mcu.h
// Register: PSMC2PRL
#define PSMC2PRL PSMC2PRL
extern volatile unsigned char           PSMC2PRL            __at(0x845);
#ifndef _LIB_BUILD
asm("PSMC2PRL equ 0845h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2PR0               :1;
        unsigned PSMC2PR1               :1;
        unsigned PSMC2PR2               :1;
        unsigned PSMC2PR3               :1;
        unsigned PSMC2PR4               :1;
        unsigned PSMC2PR5               :1;
        unsigned PSMC2PR6               :1;
        unsigned PSMC2PR7               :1;
    };
} PSMC2PRLbits_t;
extern volatile PSMC2PRLbits_t PSMC2PRLbits __at(0x845);
// bitfield macros
#define _PSMC2PRL_PSMC2PR0_POSN                             0x0
#define _PSMC2PRL_PSMC2PR0_POSITION                         0x0
#define _PSMC2PRL_PSMC2PR0_SIZE                             0x1
#define _PSMC2PRL_PSMC2PR0_LENGTH                           0x1
#define _PSMC2PRL_PSMC2PR0_MASK                             0x1
#define _PSMC2PRL_PSMC2PR1_POSN                             0x1
#define _PSMC2PRL_PSMC2PR1_POSITION                         0x1
#define _PSMC2PRL_PSMC2PR1_SIZE                             0x1
#define _PSMC2PRL_PSMC2PR1_LENGTH                           0x1
#define _PSMC2PRL_PSMC2PR1_MASK                             0x2
#define _PSMC2PRL_PSMC2PR2_POSN                             0x2
#define _PSMC2PRL_PSMC2PR2_POSITION                         0x2
#define _PSMC2PRL_PSMC2PR2_SIZE                             0x1
#define _PSMC2PRL_PSMC2PR2_LENGTH                           0x1
#define _PSMC2PRL_PSMC2PR2_MASK                             0x4
#define _PSMC2PRL_PSMC2PR3_POSN                             0x3
#define _PSMC2PRL_PSMC2PR3_POSITION                         0x3
#define _PSMC2PRL_PSMC2PR3_SIZE                             0x1
#define _PSMC2PRL_PSMC2PR3_LENGTH                           0x1
#define _PSMC2PRL_PSMC2PR3_MASK                             0x8
#define _PSMC2PRL_PSMC2PR4_POSN                             0x4
#define _PSMC2PRL_PSMC2PR4_POSITION                         0x4
#define _PSMC2PRL_PSMC2PR4_SIZE                             0x1
#define _PSMC2PRL_PSMC2PR4_LENGTH                           0x1
#define _PSMC2PRL_PSMC2PR4_MASK                             0x10
#define _PSMC2PRL_PSMC2PR5_POSN                             0x5
#define _PSMC2PRL_PSMC2PR5_POSITION                         0x5
#define _PSMC2PRL_PSMC2PR5_SIZE                             0x1
#define _PSMC2PRL_PSMC2PR5_LENGTH                           0x1
#define _PSMC2PRL_PSMC2PR5_MASK                             0x20
#define _PSMC2PRL_PSMC2PR6_POSN                             0x6
#define _PSMC2PRL_PSMC2PR6_POSITION                         0x6
#define _PSMC2PRL_PSMC2PR6_SIZE                             0x1
#define _PSMC2PRL_PSMC2PR6_LENGTH                           0x1
#define _PSMC2PRL_PSMC2PR6_MASK                             0x40
#define _PSMC2PRL_PSMC2PR7_POSN                             0x7
#define _PSMC2PRL_PSMC2PR7_POSITION                         0x7
#define _PSMC2PRL_PSMC2PR7_SIZE                             0x1
#define _PSMC2PRL_PSMC2PR7_LENGTH                           0x1
#define _PSMC2PRL_PSMC2PR7_MASK                             0x80

// Register: PSMC2PRH
#define PSMC2PRH PSMC2PRH
extern volatile unsigned char           PSMC2PRH            __at(0x846);
#ifndef _LIB_BUILD
asm("PSMC2PRH equ 0846h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2PR8               :1;
        unsigned PSMC2PR9               :1;
        unsigned PSMC2PR10              :1;
        unsigned PSMC2PR11              :1;
        unsigned PSMC2PR12              :1;
        unsigned PSMC2PR13              :1;
        unsigned PSMC2PR14              :1;
        unsigned PSMC2PR15              :1;
    };
} PSMC2PRHbits_t;
extern volatile PSMC2PRHbits_t PSMC2PRHbits __at(0x846);
// bitfield macros
#define _PSMC2PRH_PSMC2PR8_POSN                             0x0
#define _PSMC2PRH_PSMC2PR8_POSITION                         0x0
#define _PSMC2PRH_PSMC2PR8_SIZE                             0x1
#define _PSMC2PRH_PSMC2PR8_LENGTH                           0x1
#define _PSMC2PRH_PSMC2PR8_MASK                             0x1
#define _PSMC2PRH_PSMC2PR9_POSN                             0x1
#define _PSMC2PRH_PSMC2PR9_POSITION                         0x1
#define _PSMC2PRH_PSMC2PR9_SIZE                             0x1
#define _PSMC2PRH_PSMC2PR9_LENGTH                           0x1
#define _PSMC2PRH_PSMC2PR9_MASK                             0x2
#define _PSMC2PRH_PSMC2PR10_POSN                            0x2
#define _PSMC2PRH_PSMC2PR10_POSITION                        0x2
#define _PSMC2PRH_PSMC2PR10_SIZE                            0x1
#define _PSMC2PRH_PSMC2PR10_LENGTH                          0x1
#define _PSMC2PRH_PSMC2PR10_MASK                            0x4
#define _PSMC2PRH_PSMC2PR11_POSN                            0x3
#define _PSMC2PRH_PSMC2PR11_POSITION                        0x3
#define _PSMC2PRH_PSMC2PR11_SIZE                            0x1
#define _PSMC2PRH_PSMC2PR11_LENGTH                          0x1
#define _PSMC2PRH_PSMC2PR11_MASK                            0x8
#define _PSMC2PRH_PSMC2PR12_POSN                            0x4
#define _PSMC2PRH_PSMC2PR12_POSITION                        0x4
#define _PSMC2PRH_PSMC2PR12_SIZE                            0x1
#define _PSMC2PRH_PSMC2PR12_LENGTH                          0x1
#define _PSMC2PRH_PSMC2PR12_MASK                            0x10
#define _PSMC2PRH_PSMC2PR13_POSN                            0x5
#define _PSMC2PRH_PSMC2PR13_POSITION                        0x5
#define _PSMC2PRH_PSMC2PR13_SIZE                            0x1
#define _PSMC2PRH_PSMC2PR13_LENGTH                          0x1
#define _PSMC2PRH_PSMC2PR13_MASK                            0x20
#define _PSMC2PRH_PSMC2PR14_POSN                            0x6
#define _PSMC2PRH_PSMC2PR14_POSITION                        0x6
#define _PSMC2PRH_PSMC2PR14_SIZE                            0x1
#define _PSMC2PRH_PSMC2PR14_LENGTH                          0x1
#define _PSMC2PRH_PSMC2PR14_MASK                            0x40
#define _PSMC2PRH_PSMC2PR15_POSN                            0x7
#define _PSMC2PRH_PSMC2PR15_POSITION                        0x7
#define _PSMC2PRH_PSMC2PR15_SIZE                            0x1
#define _PSMC2PRH_PSMC2PR15_LENGTH                          0x1
#define _PSMC2PRH_PSMC2PR15_MASK                            0x80

// Register: PSMC2TMR
#define PSMC2TMR PSMC2TMR
extern volatile unsigned short          PSMC2TMR            __at(0x847);
#ifndef _LIB_BUILD
asm("PSMC2TMR equ 0847h");
#endif

// Register: PSMC2TMRL
#define PSMC2TMRL PSMC2TMRL
extern volatile unsigned char           PSMC2TMRL           __at(0x847);
#ifndef _LIB_BUILD
asm("PSMC2TMRL equ 0847h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2TMR0              :1;
        unsigned PSMC2TMR1              :1;
        unsigned PSMC2TMR2              :1;
        unsigned PSMC2TMR3              :1;
        unsigned PSMC2TMR4              :1;
        unsigned PSMC2TMR5              :1;
        unsigned PSMC2TMR6              :1;
        unsigned PSMC2TMR7              :1;
    };
} PSMC2TMRLbits_t;
extern volatile PSMC2TMRLbits_t PSMC2TMRLbits __at(0x847);
// bitfield macros
#define _PSMC2TMRL_PSMC2TMR0_POSN                           0x0
#define _PSMC2TMRL_PSMC2TMR0_POSITION                       0x0
#define _PSMC2TMRL_PSMC2TMR0_SIZE                           0x1
#define _PSMC2TMRL_PSMC2TMR0_LENGTH                         0x1
#define _PSMC2TMRL_PSMC2TMR0_MASK                           0x1
#define _PSMC2TMRL_PSMC2TMR1_POSN                           0x1
#define _PSMC2TMRL_PSMC2TMR1_POSITION                       0x1
#define _PSMC2TMRL_PSMC2TMR1_SIZE                           0x1
#define _PSMC2TMRL_PSMC2TMR1_LENGTH                         0x1
#define _PSMC2TMRL_PSMC2TMR1_MASK                           0x2
#define _PSMC2TMRL_PSMC2TMR2_POSN                           0x2
#define _PSMC2TMRL_PSMC2TMR2_POSITION                       0x2
#define _PSMC2TMRL_PSMC2TMR2_SIZE                           0x1
#define _PSMC2TMRL_PSMC2TMR2_LENGTH                         0x1
#define _PSMC2TMRL_PSMC2TMR2_MASK                           0x4
#define _PSMC2TMRL_PSMC2TMR3_POSN                           0x3
#define _PSMC2TMRL_PSMC2TMR3_POSITION                       0x3
#define _PSMC2TMRL_PSMC2TMR3_SIZE                           0x1
#define _PSMC2TMRL_PSMC2TMR3_LENGTH                         0x1
#define _PSMC2TMRL_PSMC2TMR3_MASK                           0x8
#define _PSMC2TMRL_PSMC2TMR4_POSN                           0x4
#define _PSMC2TMRL_PSMC2TMR4_POSITION                       0x4
#define _PSMC2TMRL_PSMC2TMR4_SIZE                           0x1
#define _PSMC2TMRL_PSMC2TMR4_LENGTH                         0x1
#define _PSMC2TMRL_PSMC2TMR4_MASK                           0x10
#define _PSMC2TMRL_PSMC2TMR5_POSN                           0x5
#define _PSMC2TMRL_PSMC2TMR5_POSITION                       0x5
#define _PSMC2TMRL_PSMC2TMR5_SIZE                           0x1
#define _PSMC2TMRL_PSMC2TMR5_LENGTH                         0x1
#define _PSMC2TMRL_PSMC2TMR5_MASK                           0x20
#define _PSMC2TMRL_PSMC2TMR6_POSN                           0x6
#define _PSMC2TMRL_PSMC2TMR6_POSITION                       0x6
#define _PSMC2TMRL_PSMC2TMR6_SIZE                           0x1
#define _PSMC2TMRL_PSMC2TMR6_LENGTH                         0x1
#define _PSMC2TMRL_PSMC2TMR6_MASK                           0x40
#define _PSMC2TMRL_PSMC2TMR7_POSN                           0x7
#define _PSMC2TMRL_PSMC2TMR7_POSITION                       0x7
#define _PSMC2TMRL_PSMC2TMR7_SIZE                           0x1
#define _PSMC2TMRL_PSMC2TMR7_LENGTH                         0x1
#define _PSMC2TMRL_PSMC2TMR7_MASK                           0x80

// Register: PSMC2TMRH
#define PSMC2TMRH PSMC2TMRH
extern volatile unsigned char           PSMC2TMRH           __at(0x848);
#ifndef _LIB_BUILD
asm("PSMC2TMRH equ 0848h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2TMR8              :1;
        unsigned PSMC2TMR9              :1;
        unsigned PSMC2TMR10             :1;
        unsigned PSMC2TMR11             :1;
        unsigned PSMC2TMR12             :1;
        unsigned PSMC2TMR13             :1;
        unsigned PSMC2TMR14             :1;
        unsigned PSMC2TMR15             :1;
    };
} PSMC2TMRHbits_t;
extern volatile PSMC2TMRHbits_t PSMC2TMRHbits __at(0x848);
// bitfield macros
#define _PSMC2TMRH_PSMC2TMR8_POSN                           0x0
#define _PSMC2TMRH_PSMC2TMR8_POSITION                       0x0
#define _PSMC2TMRH_PSMC2TMR8_SIZE                           0x1
#define _PSMC2TMRH_PSMC2TMR8_LENGTH                         0x1
#define _PSMC2TMRH_PSMC2TMR8_MASK                           0x1
#define _PSMC2TMRH_PSMC2TMR9_POSN                           0x1
#define _PSMC2TMRH_PSMC2TMR9_POSITION                       0x1
#define _PSMC2TMRH_PSMC2TMR9_SIZE                           0x1
#define _PSMC2TMRH_PSMC2TMR9_LENGTH                         0x1
#define _PSMC2TMRH_PSMC2TMR9_MASK                           0x2
#define _PSMC2TMRH_PSMC2TMR10_POSN                          0x2
#define _PSMC2TMRH_PSMC2TMR10_POSITION                      0x2
#define _PSMC2TMRH_PSMC2TMR10_SIZE                          0x1
#define _PSMC2TMRH_PSMC2TMR10_LENGTH                        0x1
#define _PSMC2TMRH_PSMC2TMR10_MASK                          0x4
#define _PSMC2TMRH_PSMC2TMR11_POSN                          0x3
#define _PSMC2TMRH_PSMC2TMR11_POSITION                      0x3
#define _PSMC2TMRH_PSMC2TMR11_SIZE                          0x1
#define _PSMC2TMRH_PSMC2TMR11_LENGTH                        0x1
#define _PSMC2TMRH_PSMC2TMR11_MASK                          0x8
#define _PSMC2TMRH_PSMC2TMR12_POSN                          0x4
#define _PSMC2TMRH_PSMC2TMR12_POSITION                      0x4
#define _PSMC2TMRH_PSMC2TMR12_SIZE                          0x1
#define _PSMC2TMRH_PSMC2TMR12_LENGTH                        0x1
#define _PSMC2TMRH_PSMC2TMR12_MASK                          0x10
#define _PSMC2TMRH_PSMC2TMR13_POSN                          0x5
#define _PSMC2TMRH_PSMC2TMR13_POSITION                      0x5
#define _PSMC2TMRH_PSMC2TMR13_SIZE                          0x1
#define _PSMC2TMRH_PSMC2TMR13_LENGTH                        0x1
#define _PSMC2TMRH_PSMC2TMR13_MASK                          0x20
#define _PSMC2TMRH_PSMC2TMR14_POSN                          0x6
#define _PSMC2TMRH_PSMC2TMR14_POSITION                      0x6
#define _PSMC2TMRH_PSMC2TMR14_SIZE                          0x1
#define _PSMC2TMRH_PSMC2TMR14_LENGTH                        0x1
#define _PSMC2TMRH_PSMC2TMR14_MASK                          0x40
#define _PSMC2TMRH_PSMC2TMR15_POSN                          0x7
#define _PSMC2TMRH_PSMC2TMR15_POSITION                      0x7
#define _PSMC2TMRH_PSMC2TMR15_SIZE                          0x1
#define _PSMC2TMRH_PSMC2TMR15_LENGTH                        0x1
#define _PSMC2TMRH_PSMC2TMR15_MASK                          0x80

// Register: PSMC2DBR
#define PSMC2DBR PSMC2DBR
extern volatile unsigned char           PSMC2DBR            __at(0x849);
#ifndef _LIB_BUILD
asm("PSMC2DBR equ 0849h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2DBR0              :1;
        unsigned PSMC2DBR1              :1;
        unsigned PSMC2DBR2              :1;
        unsigned PSMC2DBR3              :1;
        unsigned PSMC2DBR4              :1;
        unsigned PSMC2DBR5              :1;
        unsigned PSMC2DBR6              :1;
        unsigned PSMC2DBR7              :1;
    };
} PSMC2DBRbits_t;
extern volatile PSMC2DBRbits_t PSMC2DBRbits __at(0x849);
// bitfield macros
#define _PSMC2DBR_PSMC2DBR0_POSN                            0x0
#define _PSMC2DBR_PSMC2DBR0_POSITION                        0x0
#define _PSMC2DBR_PSMC2DBR0_SIZE                            0x1
#define _PSMC2DBR_PSMC2DBR0_LENGTH                          0x1
#define _PSMC2DBR_PSMC2DBR0_MASK                            0x1
#define _PSMC2DBR_PSMC2DBR1_POSN                            0x1
#define _PSMC2DBR_PSMC2DBR1_POSITION                        0x1
#define _PSMC2DBR_PSMC2DBR1_SIZE                            0x1
#define _PSMC2DBR_PSMC2DBR1_LENGTH                          0x1
#define _PSMC2DBR_PSMC2DBR1_MASK                            0x2
#define _PSMC2DBR_PSMC2DBR2_POSN                            0x2
#define _PSMC2DBR_PSMC2DBR2_POSITION                        0x2
#define _PSMC2DBR_PSMC2DBR2_SIZE                            0x1
#define _PSMC2DBR_PSMC2DBR2_LENGTH                          0x1
#define _PSMC2DBR_PSMC2DBR2_MASK                            0x4
#define _PSMC2DBR_PSMC2DBR3_POSN                            0x3
#define _PSMC2DBR_PSMC2DBR3_POSITION                        0x3
#define _PSMC2DBR_PSMC2DBR3_SIZE                            0x1
#define _PSMC2DBR_PSMC2DBR3_LENGTH                          0x1
#define _PSMC2DBR_PSMC2DBR3_MASK                            0x8
#define _PSMC2DBR_PSMC2DBR4_POSN                            0x4
#define _PSMC2DBR_PSMC2DBR4_POSITION                        0x4
#define _PSMC2DBR_PSMC2DBR4_SIZE                            0x1
#define _PSMC2DBR_PSMC2DBR4_LENGTH                          0x1
#define _PSMC2DBR_PSMC2DBR4_MASK                            0x10
#define _PSMC2DBR_PSMC2DBR5_POSN                            0x5
#define _PSMC2DBR_PSMC2DBR5_POSITION                        0x5
#define _PSMC2DBR_PSMC2DBR5_SIZE                            0x1
#define _PSMC2DBR_PSMC2DBR5_LENGTH                          0x1
#define _PSMC2DBR_PSMC2DBR5_MASK                            0x20
#define _PSMC2DBR_PSMC2DBR6_POSN                            0x6
#define _PSMC2DBR_PSMC2DBR6_POSITION                        0x6
#define _PSMC2DBR_PSMC2DBR6_SIZE                            0x1
#define _PSMC2DBR_PSMC2DBR6_LENGTH                          0x1
#define _PSMC2DBR_PSMC2DBR6_MASK                            0x40
#define _PSMC2DBR_PSMC2DBR7_POSN                            0x7
#define _PSMC2DBR_PSMC2DBR7_POSITION                        0x7
#define _PSMC2DBR_PSMC2DBR7_SIZE                            0x1
#define _PSMC2DBR_PSMC2DBR7_LENGTH                          0x1
#define _PSMC2DBR_PSMC2DBR7_MASK                            0x80

// Register: PSMC2DBF
#define PSMC2DBF PSMC2DBF
extern volatile unsigned char           PSMC2DBF            __at(0x84A);
#ifndef _LIB_BUILD
asm("PSMC2DBF equ 084Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2DBF0              :1;
        unsigned PSMC2DBF1              :1;
        unsigned PSMC2DBF2              :1;
        unsigned PSMC2DBF3              :1;
        unsigned PSMC2DBF4              :1;
        unsigned PSMC2DBF5              :1;
        unsigned PSMC2DBF6              :1;
        unsigned PSMC2DBF7              :1;
    };
} PSMC2DBFbits_t;
extern volatile PSMC2DBFbits_t PSMC2DBFbits __at(0x84A);
// bitfield macros
#define _PSMC2DBF_PSMC2DBF0_POSN                            0x0
#define _PSMC2DBF_PSMC2DBF0_POSITION                        0x0
#define _PSMC2DBF_PSMC2DBF0_SIZE                            0x1
#define _PSMC2DBF_PSMC2DBF0_LENGTH                          0x1
#define _PSMC2DBF_PSMC2DBF0_MASK                            0x1
#define _PSMC2DBF_PSMC2DBF1_POSN                            0x1
#define _PSMC2DBF_PSMC2DBF1_POSITION                        0x1
#define _PSMC2DBF_PSMC2DBF1_SIZE                            0x1
#define _PSMC2DBF_PSMC2DBF1_LENGTH                          0x1
#define _PSMC2DBF_PSMC2DBF1_MASK                            0x2
#define _PSMC2DBF_PSMC2DBF2_POSN                            0x2
#define _PSMC2DBF_PSMC2DBF2_POSITION                        0x2
#define _PSMC2DBF_PSMC2DBF2_SIZE                            0x1
#define _PSMC2DBF_PSMC2DBF2_LENGTH                          0x1
#define _PSMC2DBF_PSMC2DBF2_MASK                            0x4
#define _PSMC2DBF_PSMC2DBF3_POSN                            0x3
#define _PSMC2DBF_PSMC2DBF3_POSITION                        0x3
#define _PSMC2DBF_PSMC2DBF3_SIZE                            0x1
#define _PSMC2DBF_PSMC2DBF3_LENGTH                          0x1
#define _PSMC2DBF_PSMC2DBF3_MASK                            0x8
#define _PSMC2DBF_PSMC2DBF4_POSN                            0x4
#define _PSMC2DBF_PSMC2DBF4_POSITION                        0x4
#define _PSMC2DBF_PSMC2DBF4_SIZE                            0x1
#define _PSMC2DBF_PSMC2DBF4_LENGTH                          0x1
#define _PSMC2DBF_PSMC2DBF4_MASK                            0x10
#define _PSMC2DBF_PSMC2DBF5_POSN                            0x5
#define _PSMC2DBF_PSMC2DBF5_POSITION                        0x5
#define _PSMC2DBF_PSMC2DBF5_SIZE                            0x1
#define _PSMC2DBF_PSMC2DBF5_LENGTH                          0x1
#define _PSMC2DBF_PSMC2DBF5_MASK                            0x20
#define _PSMC2DBF_PSMC2DBF6_POSN                            0x6
#define _PSMC2DBF_PSMC2DBF6_POSITION                        0x6
#define _PSMC2DBF_PSMC2DBF6_SIZE                            0x1
#define _PSMC2DBF_PSMC2DBF6_LENGTH                          0x1
#define _PSMC2DBF_PSMC2DBF6_MASK                            0x40
#define _PSMC2DBF_PSMC2DBF7_POSN                            0x7
#define _PSMC2DBF_PSMC2DBF7_POSITION                        0x7
#define _PSMC2DBF_PSMC2DBF7_SIZE                            0x1
#define _PSMC2DBF_PSMC2DBF7_LENGTH                          0x1
#define _PSMC2DBF_PSMC2DBF7_MASK                            0x80

// Register: PSMC2BLKR
#define PSMC2BLKR PSMC2BLKR
extern volatile unsigned char           PSMC2BLKR           __at(0x84B);
#ifndef _LIB_BUILD
asm("PSMC2BLKR equ 084Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC2BLKR0             :1;
        unsigned PSMC2BLKR1             :1;
        unsigned PSMC2BLKR2             :1;
        unsigned PSMC2BLKR3             :1;
        unsigned PSMC2BLKR4             :1;
        unsigned PSMC2BLKR5             :1;
        unsigned PSMC2BLKR6             :1;
        unsigned PSMC2BLKR7             :1;
    };
} PSMC2BLKRbits_t;
extern volatile PSMC2BLKRbits_t PSMC2BLKRbits __at(0x84B);
// bitfield macros
#define _PSMC2BLKR_PSMC2BLKR0_POSN                          0x0
#define _PSMC2BLKR_PSMC2BLKR0_POSITION                      0x0
#define _PSMC2BLKR_PSMC2BLKR0_SIZE                          0x1
#define _PSMC2BLKR_PSMC2BLKR0_LENGTH                        0x1
#define _PSMC2BLKR_PSMC2BLKR0_MASK                          0x1
#define _PSMC2BLKR_PSMC2BLKR1_POSN                          0x1
#define _PSMC2BLKR_PSMC2BLKR1_POSITION                      0x1
#define _PSMC2BLKR_PSMC2BLKR1_SIZE                          0x1
#define _PSMC2BLKR_PSMC2BLKR1_LENGTH                        0x1
#define _PSMC2BLKR_PSMC2BLKR1_MASK                          0x2
#define _PSMC2BLKR_PSMC2BLKR2_POSN                          0x2
#define _PSMC2BLKR_PSMC2BLKR2_POSITION                      0x2
#define _PSMC2BLKR_PSMC2BLKR2_SIZE                          0x1
#define _PSMC2BLKR_PSMC2BLKR2_LENGTH                        0x1
#define _PSMC2BLKR_PSMC2BLKR2_MASK                          0x4
#define _PSMC2BLKR_PSMC2BLKR3_POSN                          0x3
#define _PSMC2BLKR_PSMC2BLKR3_POSITION                      0x3
#define _PSMC2BLKR_PSMC2BLKR3_SIZE                          0x1
#define _PSMC2BLKR_PSMC2BLKR3_LENGTH                        0x1
#define _PSMC2BLKR_PSMC2BLKR3_MASK                          0x8
#define _PSMC2BLKR_PSMC2BLKR4_POSN                          0x4
#define _PSMC2BLKR_PSMC2BLKR4_POSITION                      0x4
#define _PSMC2BLKR_PSMC2BLKR4_SIZE                          0x1
#define _PSMC2BLKR_PSMC2BLKR4_LENGTH                        0x1
#define _PSMC2BLKR_PSMC2BLKR4_MASK                          0x10
#define _PSMC2BLKR_PSMC2BLKR5_POSN                          0x5
#define _PSMC2BLKR_PSMC2BLKR5_POSITION                      0x5
#define _PSMC2BLKR_PSMC2BLKR5_SIZE                          0x1
#define _PSMC2BLKR_PSMC2BLKR5_LENGTH                        0x1
#define _PSMC2BLKR_PSMC2BLKR5_MASK                          0x20
#define _PSMC2BLKR_PSMC2BLKR6_POSN                          0x6
#define _PSMC2BLKR_PSMC2BLKR6_POSITION                      0x6
#define _PSMC2BLKR_PSMC2BLKR6_SIZE                          0x1
#define _PSMC2BLKR_PSMC2BLKR6_LENGTH                        0x1
#define _PSMC2BLKR_PSMC2BLKR6_MASK                          0x40
#define _PSMC2BLKR_PSMC2BLKR7_POSN                          0x7
#define _PSMC2BLKR_PSMC2BLKR7_POSITION                      0x7
#define _PSMC2BLKR_PSMC2BLKR7_SIZE                          0x1
#define _PSMC2BLKR_PSMC2BLKR7_LENGTH                        0x1
#define _PSMC2BLKR_PSMC2BLKR7_MASK                          0x80

