MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1783/mcu.h
#define                                 P1CPRE0_bit         _BIT_ACCESS(PSMC1CLK,4)
// PSMC1CLK<P1CPRE1>
extern volatile __bit                   P1CPRE1             __at(0x40A5);	// @ (0x814 * 8 + 5)
#define                                 P1CPRE1_bit         _BIT_ACCESS(PSMC1CLK,5)
// PSMC1CLK<P1CSRC0>
extern volatile __bit                   P1CSRC0             __at(0x40A0);	// @ (0x814 * 8 + 0)
#define                                 P1CSRC0_bit         _BIT_ACCESS(PSMC1CLK,0)
// PSMC1CLK<P1CSRC1>
extern volatile __bit                   P1CSRC1             __at(0x40A1);	// @ (0x814 * 8 + 1)
#define                                 P1CSRC1_bit         _BIT_ACCESS(PSMC1CLK,1)
// PSMC1CON<P1DBFE>
extern volatile __bit                   P1DBFE              __at(0x408D);	// @ (0x811 * 8 + 5)
#define                                 P1DBFE_bit          _BIT_ACCESS(PSMC1CON,5)
// PSMC1CON<P1DBRE>
extern volatile __bit                   P1DBRE              __at(0x408C);	// @ (0x811 * 8 + 4)
#define                                 P1DBRE_bit          _BIT_ACCESS(PSMC1CON,4)
// PSMC1DCS<P1DCSC1>
extern volatile __bit                   P1DCSC1             __at(0x40D9);	// @ (0x81B * 8 + 1)
#define                                 P1DCSC1_bit         _BIT_ACCESS(PSMC1DCS,1)
// PSMC1DCS<P1DCSC2>
extern volatile __bit                   P1DCSC2             __at(0x40DA);	// @ (0x81B * 8 + 2)
#define                                 P1DCSC2_bit         _BIT_ACCESS(PSMC1DCS,2)
// PSMC1DCS<P1DCSC3>
extern volatile __bit                   P1DCSC3             __at(0x40DB);	// @ (0x81B * 8 + 3)
#define                                 P1DCSC3_bit         _BIT_ACCESS(PSMC1DCS,3)
// PSMC1DCS<P1DCSIN>
extern volatile __bit                   P1DCSIN             __at(0x40DF);	// @ (0x81B * 8 + 7)
#define                                 P1DCSIN_bit         _BIT_ACCESS(PSMC1DCS,7)
// PSMC1DCS<P1DCST>
extern volatile __bit                   P1DCST              __at(0x40D8);	// @ (0x81B * 8 + 0)
#define                                 P1DCST_bit          _BIT_ACCESS(PSMC1DCS,0)
// PSMC1BLNK<P1FEBM0>
extern volatile __bit                   P1FEBM0             __at(0x40BC);	// @ (0x817 * 8 + 4)
#define                                 P1FEBM0_bit         _BIT_ACCESS(PSMC1BLNK,4)
// PSMC1BLNK<P1FEBM1>
extern volatile __bit                   P1FEBM1             __at(0x40BD);	// @ (0x817 * 8 + 5)
#define                                 P1FEBM1_bit         _BIT_ACCESS(PSMC1BLNK,5)
// PSMC1FEBS<P1FEBSC1>
extern volatile __bit                   P1FEBSC1            __at(0x40C9);	// @ (0x819 * 8 + 1)
#define                                 P1FEBSC1_bit        _BIT_ACCESS(PSMC1FEBS,1)
// PSMC1FEBS<P1FEBSC2>
extern volatile __bit                   P1FEBSC2            __at(0x40CA);	// @ (0x819 * 8 + 2)
#define                                 P1FEBSC2_bit        _BIT_ACCESS(PSMC1FEBS,2)
// PSMC1FEBS<P1FEBSC3>
extern volatile __bit                   P1FEBSC3            __at(0x40CB);	// @ (0x819 * 8 + 3)
#define                                 P1FEBSC3_bit        _BIT_ACCESS(PSMC1FEBS,3)
// PSMC1FEBS<P1FEBSIN>
extern volatile __bit                   P1FEBSIN            __at(0x40CF);	// @ (0x819 * 8 + 7)
#define                                 P1FEBSIN_bit        _BIT_ACCESS(PSMC1FEBS,7)
// PSMC1STR1<P1HSMEN>
extern volatile __bit                   P1HSMEN             __at(0x4178);	// @ (0x82F * 8 + 0)
#define                                 P1HSMEN_bit         _BIT_ACCESS(PSMC1STR1,0)
// PSMC1POL<P1INPOL>
extern volatile __bit                   P1INPOL             __at(0x40B6);	// @ (0x816 * 8 + 6)
#define                                 P1INPOL_bit         _BIT_ACCESS(PSMC1POL,6)
// PSMC1STR1<P1LSMEN>
extern volatile __bit                   P1LSMEN             __at(0x4179);	// @ (0x82F * 8 + 1)
#define                                 P1LSMEN_bit         _BIT_ACCESS(PSMC1STR1,1)
// CCP1CON<P1M0>
extern volatile __bit                   P1M0                __at(0x149E);	// @ (0x293 * 8 + 6)
#define                                 P1M0_bit            _BIT_ACCESS(CCP1CON,6)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x149F);	// @ (0x293 * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// PSMC1MDL<P1MDLBIT>
extern volatile __bit                   P1MDLBIT            __at(0x4095);	// @ (0x812 * 8 + 5)
#define                                 P1MDLBIT_bit        _BIT_ACCESS(PSMC1MDL,5)
// PSMC1MDL<P1MDLEN>
extern volatile __bit                   P1MDLEN             __at(0x4097);	// @ (0x812 * 8 + 7)
#define                                 P1MDLEN_bit         _BIT_ACCESS(PSMC1MDL,7)
// PSMC1MDL<P1MDLPOL>
extern volatile __bit                   P1MDLPOL            __at(0x4096);	// @ (0x812 * 8 + 6)
#define                                 P1MDLPOL_bit        _BIT_ACCESS(PSMC1MDL,6)
// PSMC1CON<P1MODE0>
extern volatile __bit                   P1MODE0             __at(0x4088);	// @ (0x811 * 8 + 0)
#define                                 P1MODE0_bit         _BIT_ACCESS(PSMC1CON,0)
// PSMC1CON<P1MODE1>
extern volatile __bit                   P1MODE1             __at(0x4089);	// @ (0x811 * 8 + 1)
#define                                 P1MODE1_bit         _BIT_ACCESS(PSMC1CON,1)
// PSMC1CON<P1MODE2>
extern volatile __bit                   P1MODE2             __at(0x408A);	// @ (0x811 * 8 + 2)
#define                                 P1MODE2_bit         _BIT_ACCESS(PSMC1CON,2)
// PSMC1CON<P1MODE3>
extern volatile __bit                   P1MODE3             __at(0x408B);	// @ (0x811 * 8 + 3)
#define                                 P1MODE3_bit         _BIT_ACCESS(PSMC1CON,3)
// PSMC1MDL<P1MSRC0>
extern volatile __bit                   P1MSRC0             __at(0x4090);	// @ (0x812 * 8 + 0)
#define                                 P1MSRC0_bit         _BIT_ACCESS(PSMC1MDL,0)
// PSMC1MDL<P1MSRC1>
extern volatile __bit                   P1MSRC1             __at(0x4091);	// @ (0x812 * 8 + 1)
#define                                 P1MSRC1_bit         _BIT_ACCESS(PSMC1MDL,1)
// PSMC1MDL<P1MSRC2>
extern volatile __bit                   P1MSRC2             __at(0x4092);	// @ (0x812 * 8 + 2)
#define                                 P1MSRC2_bit         _BIT_ACCESS(PSMC1MDL,2)
// PSMC1MDL<P1MSRC3>
extern volatile __bit                   P1MSRC3             __at(0x4093);	// @ (0x812 * 8 + 3)
#define                                 P1MSRC3_bit         _BIT_ACCESS(PSMC1MDL,3)
// PSMC1OEN<P1OEA>
extern volatile __bit                   P1OEA               __at(0x40A8);	// @ (0x815 * 8 + 0)
#define                                 P1OEA_bit           _BIT_ACCESS(PSMC1OEN,0)
// PSMC1OEN<P1OEB>
extern volatile __bit                   P1OEB               __at(0x40A9);	// @ (0x815 * 8 + 1)
#define                                 P1OEB_bit           _BIT_ACCESS(PSMC1OEN,1)
// PSMC1OEN<P1OEC>
extern volatile __bit                   P1OEC               __at(0x40AA);	// @ (0x815 * 8 + 2)
#define                                 P1OEC_bit           _BIT_ACCESS(PSMC1OEN,2)
// PSMC1OEN<P1OED>
extern volatile __bit                   P1OED               __at(0x40AB);	// @ (0x815 * 8 + 3)
#define                                 P1OED_bit           _BIT_ACCESS(PSMC1OEN,3)
// PSMC1OEN<P1OEE>
extern volatile __bit                   P1OEE               __at(0x40AC);	// @ (0x815 * 8 + 4)
#define                                 P1OEE_bit           _BIT_ACCESS(PSMC1OEN,4)
// PSMC1OEN<P1OEF>
extern volatile __bit                   P1OEF               __at(0x40AD);	// @ (0x815 * 8 + 5)
#define                                 P1OEF_bit           _BIT_ACCESS(PSMC1OEN,5)
// PSMC1PHS<P1PHSC1>
extern volatile __bit                   P1PHSC1             __at(0x40D1);	// @ (0x81A * 8 + 1)
#define                                 P1PHSC1_bit         _BIT_ACCESS(PSMC1PHS,1)
// PSMC1PHS<P1PHSC2>
extern volatile __bit                   P1PHSC2             __at(0x40D2);	// @ (0x81A * 8 + 2)
#define                                 P1PHSC2_bit         _BIT_ACCESS(PSMC1PHS,2)
// PSMC1PHS<P1PHSC3>
extern volatile __bit                   P1PHSC3             __at(0x40D3);	// @ (0x81A * 8 + 3)
#define                                 P1PHSC3_bit         _BIT_ACCESS(PSMC1PHS,3)
// PSMC1PHS<P1PHSIN>
extern volatile __bit                   P1PHSIN             __at(0x40D7);	// @ (0x81A * 8 + 7)
#define                                 P1PHSIN_bit         _BIT_ACCESS(PSMC1PHS,7)
// PSMC1PHS<P1PHST>
extern volatile __bit                   P1PHST              __at(0x40D0);	// @ (0x81A * 8 + 0)
#define                                 P1PHST_bit          _BIT_ACCESS(PSMC1PHS,0)
// PSMC1POL<P1POLA>
extern volatile __bit                   P1POLA              __at(0x40B0);	// @ (0x816 * 8 + 0)
#define                                 P1POLA_bit          _BIT_ACCESS(PSMC1POL,0)
// PSMC1POL<P1POLB>
extern volatile __bit                   P1POLB              __at(0x40B1);	// @ (0x816 * 8 + 1)
#define                                 P1POLB_bit          _BIT_ACCESS(PSMC1POL,1)
// PSMC1POL<P1POLC>
extern volatile __bit                   P1POLC              __at(0x40B2);	// @ (0x816 * 8 + 2)
#define                                 P1POLC_bit          _BIT_ACCESS(PSMC1POL,2)
// PSMC1POL<P1POLD>
extern volatile __bit                   P1POLD              __at(0x40B3);	// @ (0x816 * 8 + 3)
#define                                 P1POLD_bit          _BIT_ACCESS(PSMC1POL,3)
// PSMC1POL<P1POLE>
extern volatile __bit                   P1POLE              __at(0x40B4);	// @ (0x816 * 8 + 4)
#define                                 P1POLE_bit          _BIT_ACCESS(PSMC1POL,4)
// PSMC1POL<P1POLF>
extern volatile __bit                   P1POLF              __at(0x40B5);	// @ (0x816 * 8 + 5)
#define                                 P1POLF_bit          _BIT_ACCESS(PSMC1POL,5)
// PSMC1PRS<P1PRSC1>
extern volatile __bit                   P1PRSC1             __at(0x40E1);	// @ (0x81C * 8 + 1)
#define                                 P1PRSC1_bit         _BIT_ACCESS(PSMC1PRS,1)
// PSMC1PRS<P1PRSC2>
extern volatile __bit                   P1PRSC2             __at(0x40E2);	// @ (0x81C * 8 + 2)
#define                                 P1PRSC2_bit         _BIT_ACCESS(PSMC1PRS,2)
// PSMC1PRS<P1PRSC3>
extern volatile __bit                   P1PRSC3             __at(0x40E3);	// @ (0x81C * 8 + 3)
#define                                 P1PRSC3_bit         _BIT_ACCESS(PSMC1PRS,3)
// PSMC1PRS<P1PRSIN>
extern volatile __bit                   P1PRSIN             __at(0x40E7);	// @ (0x81C * 8 + 7)
#define                                 P1PRSIN_bit         _BIT_ACCESS(PSMC1PRS,7)
// PSMC1PRS<P1PRST>
extern volatile __bit                   P1PRST              __at(0x40E0);	// @ (0x81C * 8 + 0)
#define                                 P1PRST_bit          _BIT_ACCESS(PSMC1PRS,0)
// PSMC1BLNK<P1REBM0>
extern volatile __bit                   P1REBM0             __at(0x40B8);	// @ (0x817 * 8 + 0)
#define                                 P1REBM0_bit         _BIT_ACCESS(PSMC1BLNK,0)
// PSMC1BLNK<P1REBM1>
extern volatile __bit                   P1REBM1             __at(0x40B9);	// @ (0x817 * 8 + 1)
#define                                 P1REBM1_bit         _BIT_ACCESS(PSMC1BLNK,1)
// PSMC1REBS<P1REBSC1>
extern volatile __bit                   P1REBSC1            __at(0x40C1);	// @ (0x818 * 8 + 1)
#define                                 P1REBSC1_bit        _BIT_ACCESS(PSMC1REBS,1)
// PSMC1REBS<P1REBSC2>
extern volatile __bit                   P1REBSC2            __at(0x40C2);	// @ (0x818 * 8 + 2)
#define                                 P1REBSC2_bit        _BIT_ACCESS(PSMC1REBS,2)
// PSMC1REBS<P1REBSC3>
extern volatile __bit                   P1REBSC3            __at(0x40C3);	// @ (0x818 * 8 + 3)
#define                                 P1REBSC3_bit        _BIT_ACCESS(PSMC1REBS,3)
// PSMC1REBS<P1REBSIN>
extern volatile __bit                   P1REBSIN            __at(0x40C7);	// @ (0x818 * 8 + 7)
#define                                 P1REBSIN_bit        _BIT_ACCESS(PSMC1REBS,7)
// PSMC1STR1<P1SSYNC>
extern volatile __bit                   P1SSYNC             __at(0x417F);	// @ (0x82F * 8 + 7)
#define                                 P1SSYNC_bit         _BIT_ACCESS(PSMC1STR1,7)
// PSMC1STR0<P1STRA>
extern volatile __bit                   P1STRA              __at(0x4170);	// @ (0x82E * 8 + 0)
#define                                 P1STRA_bit          _BIT_ACCESS(PSMC1STR0,0)
// PSMC1STR0<P1STRB>
extern volatile __bit                   P1STRB              __at(0x4171);	// @ (0x82E * 8 + 1)
#define                                 P1STRB_bit          _BIT_ACCESS(PSMC1STR0,1)
// PSMC1STR0<P1STRC>
extern volatile __bit                   P1STRC              __at(0x4172);	// @ (0x82E * 8 + 2)
#define                                 P1STRC_bit          _BIT_ACCESS(PSMC1STR0,2)
// PSMC1STR0<P1STRD>
extern volatile __bit                   P1STRD              __at(0x4173);	// @ (0x82E * 8 + 3)
#define                                 P1STRD_bit          _BIT_ACCESS(PSMC1STR0,3)
// PSMC1STR0<P1STRE>
extern volatile __bit                   P1STRE              __at(0x4174);	// @ (0x82E * 8 + 4)
#define                                 P1STRE_bit          _BIT_ACCESS(PSMC1STR0,4)
// PSMC1STR0<P1STRF>
extern volatile __bit                   P1STRF              __at(0x4175);	// @ (0x82E * 8 + 5)
#define                                 P1STRF_bit          _BIT_ACCESS(PSMC1STR0,5)
// PSMC1SYNC<P1SYNC0>
extern volatile __bit                   P1SYNC0             __at(0x4098);	// @ (0x813 * 8 + 0)
#define                                 P1SYNC0_bit         _BIT_ACCESS(PSMC1SYNC,0)
// PSMC1SYNC<P1SYNC1>
extern volatile __bit                   P1SYNC1             __at(0x4099);	// @ (0x813 * 8 + 1)
#define                                 P1SYNC1_bit         _BIT_ACCESS(PSMC1SYNC,1)
// PSMC1INT<P1TDCIE>
extern volatile __bit                   P1TDCIE             __at(0x4105);	// @ (0x820 * 8 + 5)
#define                                 P1TDCIE_bit         _BIT_ACCESS(PSMC1INT,5)
// PSMC1INT<P1TDCIF>
extern volatile __bit                   P1TDCIF             __at(0x4101);	// @ (0x820 * 8 + 1)
#define                                 P1TDCIF_bit         _BIT_ACCESS(PSMC1INT,1)
// PSMC1INT<P1TOVIE>
extern volatile __bit                   P1TOVIE             __at(0x4107);	// @ (0x820 * 8 + 7)
#define                                 P1TOVIE_bit         _BIT_ACCESS(PSMC1INT,7)
// PSMC1INT<P1TOVIF>
extern volatile __bit                   P1TOVIF             __at(0x4103);	// @ (0x820 * 8 + 3)
#define                                 P1TOVIF_bit         _BIT_ACCESS(PSMC1INT,3)
// PSMC1INT<P1TPHIE>
extern volatile __bit                   P1TPHIE             __at(0x4106);	// @ (0x820 * 8 + 6)
#define                                 P1TPHIE_bit         _BIT_ACCESS(PSMC1INT,6)
// PSMC1INT<P1TPHIF>
extern volatile __bit                   P1TPHIF             __at(0x4102);	// @ (0x820 * 8 + 2)
#define                                 P1TPHIF_bit         _BIT_ACCESS(PSMC1INT,2)
// PSMC1INT<P1TPRIE>
extern volatile __bit                   P1TPRIE             __at(0x4104);	// @ (0x820 * 8 + 4)
#define                                 P1TPRIE_bit         _BIT_ACCESS(PSMC1INT,4)
// PSMC1INT<P1TPRIF>
extern volatile __bit                   P1TPRIF             __at(0x4100);	// @ (0x820 * 8 + 0)
#define                                 P1TPRIF_bit         _BIT_ACCESS(PSMC1INT,0)
// PSMC2ASDC<P2ARSEN>
extern volatile __bit                   P2ARSEN             __at(0x41ED);	// @ (0x83D * 8 + 5)
#define                                 P2ARSEN_bit         _BIT_ACCESS(PSMC2ASDC,5)
// PSMC2ASDC<P2ASDEN>
extern volatile __bit                   P2ASDEN             __at(0x41EE);	// @ (0x83D * 8 + 6)
#define                                 P2ASDEN_bit         _BIT_ACCESS(PSMC2ASDC,6)
// PSMC2ASDL<P2ASDLA>
extern volatile __bit                   P2ASDLA             __at(0x41F0);	// @ (0x83E * 8 + 0)
#define                                 P2ASDLA_bit         _BIT_ACCESS(PSMC2ASDL,0)
// PSMC2ASDL<P2ASDLB>
extern volatile __bit                   P2ASDLB             __at(0x41F1);	// @ (0x83E * 8 + 1)
#define                                 P2ASDLB_bit         _BIT_ACCESS(PSMC2ASDL,1)
// PSMC2ASDC<P2ASDOV>
extern volatile __bit                   P2ASDOV             __at(0x41E8);	// @ (0x83D * 8 + 0)
#define                                 P2ASDOV_bit         _BIT_ACCESS(PSMC2ASDC,0)
// PSMC2ASDS<P2ASDSC1>
extern volatile __bit                   P2ASDSC1            __at(0x41F9);	// @ (0x83F * 8 + 1)
#define                                 P2ASDSC1_bit        _BIT_ACCESS(PSMC2ASDS,1)
// PSMC2ASDS<P2ASDSC2>
extern volatile __bit                   P2ASDSC2            __at(0x41FA);	// @ (0x83F * 8 + 2)
#define                                 P2ASDSC2_bit        _BIT_ACCESS(PSMC2ASDS,2)
// PSMC2ASDS<P2ASDSC3>
extern volatile __bit                   P2ASDSC3            __at(0x41FB);	// @ (0x83F * 8 + 3)
#define                                 P2ASDSC3_bit        _BIT_ACCESS(PSMC2ASDS,3)
// PSMC2ASDS<P2ASDSIN>
extern volatile __bit                   P2ASDSIN            __at(0x41FF);	// @ (0x83F * 8 + 7)
#define                                 P2ASDSIN_bit        _BIT_ACCESS(PSMC2ASDS,7)
// PSMC2ASDC<P2ASE>
extern volatile __bit                   P2ASE               __at(0x41EF);	// @ (0x83D * 8 + 7)
#define                                 P2ASE_bit           _BIT_ACCESS(PSMC2ASDC,7)
// PSMC2CLK<P2CPRE0>
extern volatile __bit                   P2CPRE0             __at(0x41A4);	// @ (0x834 * 8 + 4)
#define                                 P2CPRE0_bit         _BIT_ACCESS(PSMC2CLK,4)
// PSMC2CLK<P2CPRE1>
extern volatile __bit                   P2CPRE1             __at(0x41A5);	// @ (0x834 * 8 + 5)
#define                                 P2CPRE1_bit         _BIT_ACCESS(PSMC2CLK,5)
// PSMC2CLK<P2CSRC0>
extern volatile __bit                   P2CSRC0             __at(0x41A0);	// @ (0x834 * 8 + 0)
#define                                 P2CSRC0_bit         _BIT_ACCESS(PSMC2CLK,0)
// PSMC2CLK<P2CSRC1>
extern volatile __bit                   P2CSRC1             __at(0x41A1);	// @ (0x834 * 8 + 1)
#define                                 P2CSRC1_bit         _BIT_ACCESS(PSMC2CLK,1)
// PSMC2CON<P2DBFE>
extern volatile __bit                   P2DBFE              __at(0x418D);	// @ (0x831 * 8 + 5)
#define                                 P2DBFE_bit          _BIT_ACCESS(PSMC2CON,5)
// PSMC2CON<P2DBRE>
extern volatile __bit                   P2DBRE              __at(0x418C);	// @ (0x831 * 8 + 4)
#define                                 P2DBRE_bit          _BIT_ACCESS(PSMC2CON,4)
// PSMC2DCS<P2DCSC1>
extern volatile __bit                   P2DCSC1             __at(0x41D9);	// @ (0x83B * 8 + 1)
#define                                 P2DCSC1_bit         _BIT_ACCESS(PSMC2DCS,1)
// PSMC2DCS<P2DCSC2>
extern volatile __bit                   P2DCSC2             __at(0x41DA);	// @ (0x83B * 8 + 2)
#define                                 P2DCSC2_bit         _BIT_ACCESS(PSMC2DCS,2)
// PSMC2DCS<P2DCSC3>
extern volatile __bit                   P2DCSC3             __at(0x41DB);	// @ (0x83B * 8 + 3)
#define                                 P2DCSC3_bit         _BIT_ACCESS(PSMC2DCS,3)
// PSMC2DCS<P2DCSIN>
extern volatile __bit                   P2DCSIN             __at(0x41DF);	// @ (0x83B * 8 + 7)
#define                                 P2DCSIN_bit         _BIT_ACCESS(PSMC2DCS,7)
// PSMC2DCS<P2DCST>
extern volatile __bit                   P2DCST              __at(0x41D8);	// @ (0x83B * 8 + 0)
#define                                 P2DCST_bit          _BIT_ACCESS(PSMC2DCS,0)
// PSMC2BLNK<P2FEBM0>
extern volatile __bit                   P2FEBM0             __at(0x41BC);	// @ (0x837 * 8 + 4)
#define                                 P2FEBM0_bit         _BIT_ACCESS(PSMC2BLNK,4)
// PSMC2BLNK<P2FEBM1>
extern volatile __bit                   P2FEBM1             __at(0x41BD);	// @ (0x837 * 8 + 5)
#define                                 P2FEBM1_bit         _BIT_ACCESS(PSMC2BLNK,5)
// PSMC2FEBS<P2FEBSC1>
extern volatile __bit                   P2FEBSC1            __at(0x41C9);	// @ (0x839 * 8 + 1)
#define                                 P2FEBSC1_bit        _BIT_ACCESS(PSMC2FEBS,1)
// PSMC2FEBS<P2FEBSC2>
extern volatile __bit                   P2FEBSC2            __at(0x41CA);	// @ (0x839 * 8 + 2)
#define                                 P2FEBSC2_bit        _BIT_ACCESS(PSMC2FEBS,2)
// PSMC2FEBS<P2FEBSC3>
extern volatile __bit                   P2FEBSC3            __at(0x41CB);	// @ (0x839 * 8 + 3)
#define                                 P2FEBSC3_bit        _BIT_ACCESS(PSMC2FEBS,3)
// PSMC2FEBS<P2FEBSIN>
extern volatile __bit                   P2FEBSIN            __at(0x41CF);	// @ (0x839 * 8 + 7)
#define                                 P2FEBSIN_bit        _BIT_ACCESS(PSMC2FEBS,7)
// PSMC2STR1<P2HSMEN>
extern volatile __bit                   P2HSMEN             __at(0x4278);	// @ (0x84F * 8 + 0)
#define                                 P2HSMEN_bit         _BIT_ACCESS(PSMC2STR1,0)
// PSMC2POL<P2INPOL>
extern volatile __bit                   P2INPOL             __at(0x41B6);	// @ (0x836 * 8 + 6)
#define                                 P2INPOL_bit         _BIT_ACCESS(PSMC2POL,6)
// PSMC2STR1<P2LSMEN>
extern volatile __bit                   P2LSMEN             __at(0x4279);	// @ (0x84F * 8 + 1)
#define                                 P2LSMEN_bit         _BIT_ACCESS(PSMC2STR1,1)
// CCP2CON<P2M0>
extern volatile __bit                   P2M0                __at(0x14D6);	// @ (0x29A * 8 + 6)
#define                                 P2M0_bit            _BIT_ACCESS(CCP2CON,6)
// CCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x14D7);	// @ (0x29A * 8 + 7)
#define                                 P2M1_bit            _BIT_ACCESS(CCP2CON,7)
// PSMC2MDL<P2MDLBIT>
extern volatile __bit                   P2MDLBIT            __at(0x4195);	// @ (0x832 * 8 + 5)
#define                                 P2MDLBIT_bit        _BIT_ACCESS(PSMC2MDL,5)
// PSMC2MDL<P2MDLEN>
extern volatile __bit                   P2MDLEN             __at(0x4197);	// @ (0x832 * 8 + 7)
#define                                 P2MDLEN_bit         _BIT_ACCESS(PSMC2MDL,7)
// PSMC2MDL<P2MDLPOL>
extern volatile __bit                   P2MDLPOL            __at(0x4196);	// @ (0x832 * 8 + 6)
#define                                 P2MDLPOL_bit        _BIT_ACCESS(PSMC2MDL,6)
// PSMC2CON<P2MODE0>
extern volatile __bit                   P2MODE0             __at(0x4188);	// @ (0x831 * 8 + 0)
#define                                 P2MODE0_bit         _BIT_ACCESS(PSMC2CON,0)
// PSMC2CON<P2MODE1>
extern volatile __bit                   P2MODE1             __at(0x4189);	// @ (0x831 * 8 + 1)
#define                                 P2MODE1_bit         _BIT_ACCESS(PSMC2CON,1)
// PSMC2CON<P2MODE2>
extern volatile __bit                   P2MODE2             __at(0x418A);	// @ (0x831 * 8 + 2)
#define                                 P2MODE2_bit         _BIT_ACCESS(PSMC2CON,2)
// PSMC2CON<P2MODE3>
extern volatile __bit                   P2MODE3             __at(0x418B);	// @ (0x831 * 8 + 3)
#define                                 P2MODE3_bit         _BIT_ACCESS(PSMC2CON,3)
// PSMC2MDL<P2MSRC0>
extern volatile __bit                   P2MSRC0             __at(0x4190);	// @ (0x832 * 8 + 0)
#define                                 P2MSRC0_bit         _BIT_ACCESS(PSMC2MDL,0)
// PSMC2MDL<P2MSRC1>
extern volatile __bit                   P2MSRC1             __at(0x4191);	// @ (0x832 * 8 + 1)
#define                                 P2MSRC1_bit         _BIT_ACCESS(PSMC2MDL,1)
// PSMC2MDL<P2MSRC2>
extern volatile __bit                   P2MSRC2             __at(0x4192);	// @ (0x832 * 8 + 2)
#define                                 P2MSRC2_bit         _BIT_ACCESS(PSMC2MDL,2)
// PSMC2MDL<P2MSRC3>
