MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1783/mcu.h
extern volatile __bit                   PSMC1PR15           __at(0x4137);	// @ (0x826 * 8 + 7)
#define                                 PSMC1PR15_bit       _BIT_ACCESS(PSMC1PRH,7)
// PSMC1PRL<PSMC1PR2>
extern volatile __bit                   PSMC1PR2            __at(0x412A);	// @ (0x825 * 8 + 2)
#define                                 PSMC1PR2_bit        _BIT_ACCESS(PSMC1PRL,2)
// PSMC1PRL<PSMC1PR3>
extern volatile __bit                   PSMC1PR3            __at(0x412B);	// @ (0x825 * 8 + 3)
#define                                 PSMC1PR3_bit        _BIT_ACCESS(PSMC1PRL,3)
// PSMC1PRL<PSMC1PR4>
extern volatile __bit                   PSMC1PR4            __at(0x412C);	// @ (0x825 * 8 + 4)
#define                                 PSMC1PR4_bit        _BIT_ACCESS(PSMC1PRL,4)
// PSMC1PRL<PSMC1PR5>
extern volatile __bit                   PSMC1PR5            __at(0x412D);	// @ (0x825 * 8 + 5)
#define                                 PSMC1PR5_bit        _BIT_ACCESS(PSMC1PRL,5)
// PSMC1PRL<PSMC1PR6>
extern volatile __bit                   PSMC1PR6            __at(0x412E);	// @ (0x825 * 8 + 6)
#define                                 PSMC1PR6_bit        _BIT_ACCESS(PSMC1PRL,6)
// PSMC1PRL<PSMC1PR7>
extern volatile __bit                   PSMC1PR7            __at(0x412F);	// @ (0x825 * 8 + 7)
#define                                 PSMC1PR7_bit        _BIT_ACCESS(PSMC1PRL,7)
// PSMC1PRH<PSMC1PR8>
extern volatile __bit                   PSMC1PR8            __at(0x4130);	// @ (0x826 * 8 + 0)
#define                                 PSMC1PR8_bit        _BIT_ACCESS(PSMC1PRH,0)
// PSMC1PRH<PSMC1PR9>
extern volatile __bit                   PSMC1PR9            __at(0x4131);	// @ (0x826 * 8 + 1)
#define                                 PSMC1PR9_bit        _BIT_ACCESS(PSMC1PRH,1)
// PIE4<PSMC1SIE>
extern volatile __bit                   PSMC1SIE            __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 PSMC1SIE_bit        _BIT_ACCESS(PIE4,0)
// PIR4<PSMC1SIF>
extern volatile __bit                   PSMC1SIF            __at(0xA0);	// @ (0x14 * 8 + 0)
#define                                 PSMC1SIF_bit        _BIT_ACCESS(PIR4,0)
// PIE4<PSMC1TIE>
extern volatile __bit                   PSMC1TIE            __at(0x4A4);	// @ (0x94 * 8 + 4)
#define                                 PSMC1TIE_bit        _BIT_ACCESS(PIE4,4)
// PIR4<PSMC1TIF>
extern volatile __bit                   PSMC1TIF            __at(0xA4);	// @ (0x14 * 8 + 4)
#define                                 PSMC1TIF_bit        _BIT_ACCESS(PIR4,4)
// PSMC1TMRL<PSMC1TMR0>
extern volatile __bit                   PSMC1TMR0           __at(0x4138);	// @ (0x827 * 8 + 0)
#define                                 PSMC1TMR0_bit       _BIT_ACCESS(PSMC1TMRL,0)
// PSMC1TMRL<PSMC1TMR1>
extern volatile __bit                   PSMC1TMR1           __at(0x4139);	// @ (0x827 * 8 + 1)
#define                                 PSMC1TMR1_bit       _BIT_ACCESS(PSMC1TMRL,1)
// PSMC1TMRH<PSMC1TMR10>
extern volatile __bit                   PSMC1TMR10          __at(0x4142);	// @ (0x828 * 8 + 2)
#define                                 PSMC1TMR10_bit      _BIT_ACCESS(PSMC1TMRH,2)
// PSMC1TMRH<PSMC1TMR11>
extern volatile __bit                   PSMC1TMR11          __at(0x4143);	// @ (0x828 * 8 + 3)
#define                                 PSMC1TMR11_bit      _BIT_ACCESS(PSMC1TMRH,3)
// PSMC1TMRH<PSMC1TMR12>
extern volatile __bit                   PSMC1TMR12          __at(0x4144);	// @ (0x828 * 8 + 4)
#define                                 PSMC1TMR12_bit      _BIT_ACCESS(PSMC1TMRH,4)
// PSMC1TMRH<PSMC1TMR13>
extern volatile __bit                   PSMC1TMR13          __at(0x4145);	// @ (0x828 * 8 + 5)
#define                                 PSMC1TMR13_bit      _BIT_ACCESS(PSMC1TMRH,5)
// PSMC1TMRH<PSMC1TMR14>
extern volatile __bit                   PSMC1TMR14          __at(0x4146);	// @ (0x828 * 8 + 6)
#define                                 PSMC1TMR14_bit      _BIT_ACCESS(PSMC1TMRH,6)
// PSMC1TMRH<PSMC1TMR15>
extern volatile __bit                   PSMC1TMR15          __at(0x4147);	// @ (0x828 * 8 + 7)
#define                                 PSMC1TMR15_bit      _BIT_ACCESS(PSMC1TMRH,7)
// PSMC1TMRL<PSMC1TMR2>
extern volatile __bit                   PSMC1TMR2           __at(0x413A);	// @ (0x827 * 8 + 2)
#define                                 PSMC1TMR2_bit       _BIT_ACCESS(PSMC1TMRL,2)
// PSMC1TMRL<PSMC1TMR3>
extern volatile __bit                   PSMC1TMR3           __at(0x413B);	// @ (0x827 * 8 + 3)
#define                                 PSMC1TMR3_bit       _BIT_ACCESS(PSMC1TMRL,3)
// PSMC1TMRL<PSMC1TMR4>
extern volatile __bit                   PSMC1TMR4           __at(0x413C);	// @ (0x827 * 8 + 4)
#define                                 PSMC1TMR4_bit       _BIT_ACCESS(PSMC1TMRL,4)
// PSMC1TMRL<PSMC1TMR5>
extern volatile __bit                   PSMC1TMR5           __at(0x413D);	// @ (0x827 * 8 + 5)
#define                                 PSMC1TMR5_bit       _BIT_ACCESS(PSMC1TMRL,5)
// PSMC1TMRL<PSMC1TMR6>
extern volatile __bit                   PSMC1TMR6           __at(0x413E);	// @ (0x827 * 8 + 6)
#define                                 PSMC1TMR6_bit       _BIT_ACCESS(PSMC1TMRL,6)
// PSMC1TMRL<PSMC1TMR7>
extern volatile __bit                   PSMC1TMR7           __at(0x413F);	// @ (0x827 * 8 + 7)
#define                                 PSMC1TMR7_bit       _BIT_ACCESS(PSMC1TMRL,7)
// PSMC1TMRH<PSMC1TMR8>
extern volatile __bit                   PSMC1TMR8           __at(0x4140);	// @ (0x828 * 8 + 0)
#define                                 PSMC1TMR8_bit       _BIT_ACCESS(PSMC1TMRH,0)
// PSMC1TMRH<PSMC1TMR9>
extern volatile __bit                   PSMC1TMR9           __at(0x4141);	// @ (0x828 * 8 + 1)
#define                                 PSMC1TMR9_bit       _BIT_ACCESS(PSMC1TMRH,1)
// PSMC2BLKF<PSMC2BLKF0>
extern volatile __bit                   PSMC2BLKF0          __at(0x4260);	// @ (0x84C * 8 + 0)
#define                                 PSMC2BLKF0_bit      _BIT_ACCESS(PSMC2BLKF,0)
// PSMC2BLKF<PSMC2BLKF1>
extern volatile __bit                   PSMC2BLKF1          __at(0x4261);	// @ (0x84C * 8 + 1)
#define                                 PSMC2BLKF1_bit      _BIT_ACCESS(PSMC2BLKF,1)
// PSMC2BLKF<PSMC2BLKF2>
extern volatile __bit                   PSMC2BLKF2          __at(0x4262);	// @ (0x84C * 8 + 2)
#define                                 PSMC2BLKF2_bit      _BIT_ACCESS(PSMC2BLKF,2)
// PSMC2BLKF<PSMC2BLKF3>
extern volatile __bit                   PSMC2BLKF3          __at(0x4263);	// @ (0x84C * 8 + 3)
#define                                 PSMC2BLKF3_bit      _BIT_ACCESS(PSMC2BLKF,3)
// PSMC2BLKF<PSMC2BLKF4>
extern volatile __bit                   PSMC2BLKF4          __at(0x4264);	// @ (0x84C * 8 + 4)
#define                                 PSMC2BLKF4_bit      _BIT_ACCESS(PSMC2BLKF,4)
// PSMC2BLKF<PSMC2BLKF5>
extern volatile __bit                   PSMC2BLKF5          __at(0x4265);	// @ (0x84C * 8 + 5)
#define                                 PSMC2BLKF5_bit      _BIT_ACCESS(PSMC2BLKF,5)
// PSMC2BLKF<PSMC2BLKF6>
extern volatile __bit                   PSMC2BLKF6          __at(0x4266);	// @ (0x84C * 8 + 6)
#define                                 PSMC2BLKF6_bit      _BIT_ACCESS(PSMC2BLKF,6)
// PSMC2BLKF<PSMC2BLKF7>
extern volatile __bit                   PSMC2BLKF7          __at(0x4267);	// @ (0x84C * 8 + 7)
#define                                 PSMC2BLKF7_bit      _BIT_ACCESS(PSMC2BLKF,7)
// PSMC2BLKR<PSMC2BLKR0>
extern volatile __bit                   PSMC2BLKR0          __at(0x4258);	// @ (0x84B * 8 + 0)
#define                                 PSMC2BLKR0_bit      _BIT_ACCESS(PSMC2BLKR,0)
// PSMC2BLKR<PSMC2BLKR1>
extern volatile __bit                   PSMC2BLKR1          __at(0x4259);	// @ (0x84B * 8 + 1)
#define                                 PSMC2BLKR1_bit      _BIT_ACCESS(PSMC2BLKR,1)
// PSMC2BLKR<PSMC2BLKR2>
extern volatile __bit                   PSMC2BLKR2          __at(0x425A);	// @ (0x84B * 8 + 2)
#define                                 PSMC2BLKR2_bit      _BIT_ACCESS(PSMC2BLKR,2)
// PSMC2BLKR<PSMC2BLKR3>
extern volatile __bit                   PSMC2BLKR3          __at(0x425B);	// @ (0x84B * 8 + 3)
#define                                 PSMC2BLKR3_bit      _BIT_ACCESS(PSMC2BLKR,3)
// PSMC2BLKR<PSMC2BLKR4>
extern volatile __bit                   PSMC2BLKR4          __at(0x425C);	// @ (0x84B * 8 + 4)
#define                                 PSMC2BLKR4_bit      _BIT_ACCESS(PSMC2BLKR,4)
// PSMC2BLKR<PSMC2BLKR5>
extern volatile __bit                   PSMC2BLKR5          __at(0x425D);	// @ (0x84B * 8 + 5)
#define                                 PSMC2BLKR5_bit      _BIT_ACCESS(PSMC2BLKR,5)
// PSMC2BLKR<PSMC2BLKR6>
extern volatile __bit                   PSMC2BLKR6          __at(0x425E);	// @ (0x84B * 8 + 6)
#define                                 PSMC2BLKR6_bit      _BIT_ACCESS(PSMC2BLKR,6)
// PSMC2BLKR<PSMC2BLKR7>
extern volatile __bit                   PSMC2BLKR7          __at(0x425F);	// @ (0x84B * 8 + 7)
#define                                 PSMC2BLKR7_bit      _BIT_ACCESS(PSMC2BLKR,7)
// PSMC2DBF<PSMC2DBF0>
extern volatile __bit                   PSMC2DBF0           __at(0x4250);	// @ (0x84A * 8 + 0)
#define                                 PSMC2DBF0_bit       _BIT_ACCESS(PSMC2DBF,0)
// PSMC2DBF<PSMC2DBF1>
extern volatile __bit                   PSMC2DBF1           __at(0x4251);	// @ (0x84A * 8 + 1)
#define                                 PSMC2DBF1_bit       _BIT_ACCESS(PSMC2DBF,1)
// PSMC2DBF<PSMC2DBF2>
extern volatile __bit                   PSMC2DBF2           __at(0x4252);	// @ (0x84A * 8 + 2)
#define                                 PSMC2DBF2_bit       _BIT_ACCESS(PSMC2DBF,2)
// PSMC2DBF<PSMC2DBF3>
extern volatile __bit                   PSMC2DBF3           __at(0x4253);	// @ (0x84A * 8 + 3)
#define                                 PSMC2DBF3_bit       _BIT_ACCESS(PSMC2DBF,3)
// PSMC2DBF<PSMC2DBF4>
extern volatile __bit                   PSMC2DBF4           __at(0x4254);	// @ (0x84A * 8 + 4)
#define                                 PSMC2DBF4_bit       _BIT_ACCESS(PSMC2DBF,4)
// PSMC2DBF<PSMC2DBF5>
extern volatile __bit                   PSMC2DBF5           __at(0x4255);	// @ (0x84A * 8 + 5)
#define                                 PSMC2DBF5_bit       _BIT_ACCESS(PSMC2DBF,5)
// PSMC2DBF<PSMC2DBF6>
extern volatile __bit                   PSMC2DBF6           __at(0x4256);	// @ (0x84A * 8 + 6)
#define                                 PSMC2DBF6_bit       _BIT_ACCESS(PSMC2DBF,6)
// PSMC2DBF<PSMC2DBF7>
extern volatile __bit                   PSMC2DBF7           __at(0x4257);	// @ (0x84A * 8 + 7)
#define                                 PSMC2DBF7_bit       _BIT_ACCESS(PSMC2DBF,7)
// PSMC2DBR<PSMC2DBR0>
extern volatile __bit                   PSMC2DBR0           __at(0x4248);	// @ (0x849 * 8 + 0)
#define                                 PSMC2DBR0_bit       _BIT_ACCESS(PSMC2DBR,0)
// PSMC2DBR<PSMC2DBR1>
extern volatile __bit                   PSMC2DBR1           __at(0x4249);	// @ (0x849 * 8 + 1)
#define                                 PSMC2DBR1_bit       _BIT_ACCESS(PSMC2DBR,1)
// PSMC2DBR<PSMC2DBR2>
extern volatile __bit                   PSMC2DBR2           __at(0x424A);	// @ (0x849 * 8 + 2)
#define                                 PSMC2DBR2_bit       _BIT_ACCESS(PSMC2DBR,2)
// PSMC2DBR<PSMC2DBR3>
extern volatile __bit                   PSMC2DBR3           __at(0x424B);	// @ (0x849 * 8 + 3)
#define                                 PSMC2DBR3_bit       _BIT_ACCESS(PSMC2DBR,3)
// PSMC2DBR<PSMC2DBR4>
extern volatile __bit                   PSMC2DBR4           __at(0x424C);	// @ (0x849 * 8 + 4)
#define                                 PSMC2DBR4_bit       _BIT_ACCESS(PSMC2DBR,4)
// PSMC2DBR<PSMC2DBR5>
extern volatile __bit                   PSMC2DBR5           __at(0x424D);	// @ (0x849 * 8 + 5)
#define                                 PSMC2DBR5_bit       _BIT_ACCESS(PSMC2DBR,5)
// PSMC2DBR<PSMC2DBR6>
extern volatile __bit                   PSMC2DBR6           __at(0x424E);	// @ (0x849 * 8 + 6)
#define                                 PSMC2DBR6_bit       _BIT_ACCESS(PSMC2DBR,6)
// PSMC2DBR<PSMC2DBR7>
extern volatile __bit                   PSMC2DBR7           __at(0x424F);	// @ (0x849 * 8 + 7)
#define                                 PSMC2DBR7_bit       _BIT_ACCESS(PSMC2DBR,7)
// PSMC2DCL<PSMC2DC0>
extern volatile __bit                   PSMC2DC0            __at(0x4218);	// @ (0x843 * 8 + 0)
#define                                 PSMC2DC0_bit        _BIT_ACCESS(PSMC2DCL,0)
// PSMC2DCL<PSMC2DC1>
extern volatile __bit                   PSMC2DC1            __at(0x4219);	// @ (0x843 * 8 + 1)
#define                                 PSMC2DC1_bit        _BIT_ACCESS(PSMC2DCL,1)
// PSMC2DCH<PSMC2DC10>
extern volatile __bit                   PSMC2DC10           __at(0x4222);	// @ (0x844 * 8 + 2)
#define                                 PSMC2DC10_bit       _BIT_ACCESS(PSMC2DCH,2)
// PSMC2DCH<PSMC2DC11>
extern volatile __bit                   PSMC2DC11           __at(0x4223);	// @ (0x844 * 8 + 3)
#define                                 PSMC2DC11_bit       _BIT_ACCESS(PSMC2DCH,3)
// PSMC2DCH<PSMC2DC12>
extern volatile __bit                   PSMC2DC12           __at(0x4224);	// @ (0x844 * 8 + 4)
#define                                 PSMC2DC12_bit       _BIT_ACCESS(PSMC2DCH,4)
// PSMC2DCH<PSMC2DC13>
extern volatile __bit                   PSMC2DC13           __at(0x4225);	// @ (0x844 * 8 + 5)
#define                                 PSMC2DC13_bit       _BIT_ACCESS(PSMC2DCH,5)
// PSMC2DCH<PSMC2DC14>
extern volatile __bit                   PSMC2DC14           __at(0x4226);	// @ (0x844 * 8 + 6)
#define                                 PSMC2DC14_bit       _BIT_ACCESS(PSMC2DCH,6)
// PSMC2DCH<PSMC2DC15>
extern volatile __bit                   PSMC2DC15           __at(0x4227);	// @ (0x844 * 8 + 7)
#define                                 PSMC2DC15_bit       _BIT_ACCESS(PSMC2DCH,7)
// PSMC2DCL<PSMC2DC2>
extern volatile __bit                   PSMC2DC2            __at(0x421A);	// @ (0x843 * 8 + 2)
#define                                 PSMC2DC2_bit        _BIT_ACCESS(PSMC2DCL,2)
// PSMC2DCL<PSMC2DC3>
extern volatile __bit                   PSMC2DC3            __at(0x421B);	// @ (0x843 * 8 + 3)
#define                                 PSMC2DC3_bit        _BIT_ACCESS(PSMC2DCL,3)
// PSMC2DCL<PSMC2DC4>
extern volatile __bit                   PSMC2DC4            __at(0x421C);	// @ (0x843 * 8 + 4)
#define                                 PSMC2DC4_bit        _BIT_ACCESS(PSMC2DCL,4)
// PSMC2DCL<PSMC2DC5>
extern volatile __bit                   PSMC2DC5            __at(0x421D);	// @ (0x843 * 8 + 5)
#define                                 PSMC2DC5_bit        _BIT_ACCESS(PSMC2DCL,5)
// PSMC2DCL<PSMC2DC6>
extern volatile __bit                   PSMC2DC6            __at(0x421E);	// @ (0x843 * 8 + 6)
#define                                 PSMC2DC6_bit        _BIT_ACCESS(PSMC2DCL,6)
// PSMC2DCL<PSMC2DC7>
extern volatile __bit                   PSMC2DC7            __at(0x421F);	// @ (0x843 * 8 + 7)
#define                                 PSMC2DC7_bit        _BIT_ACCESS(PSMC2DCL,7)
// PSMC2DCH<PSMC2DC8>
extern volatile __bit                   PSMC2DC8            __at(0x4220);	// @ (0x844 * 8 + 0)
#define                                 PSMC2DC8_bit        _BIT_ACCESS(PSMC2DCH,0)
// PSMC2DCH<PSMC2DC9>
extern volatile __bit                   PSMC2DC9            __at(0x4221);	// @ (0x844 * 8 + 1)
#define                                 PSMC2DC9_bit        _BIT_ACCESS(PSMC2DCH,1)
// PSMC2CON<PSMC2EN>
extern volatile __bit                   PSMC2EN             __at(0x418F);	// @ (0x831 * 8 + 7)
#define                                 PSMC2EN_bit         _BIT_ACCESS(PSMC2CON,7)
// PSMC2FFA<PSMC2FFA0>
extern volatile __bit                   PSMC2FFA0           __at(0x4268);	// @ (0x84D * 8 + 0)
#define                                 PSMC2FFA0_bit       _BIT_ACCESS(PSMC2FFA,0)
// PSMC2FFA<PSMC2FFA1>
extern volatile __bit                   PSMC2FFA1           __at(0x4269);	// @ (0x84D * 8 + 1)
#define                                 PSMC2FFA1_bit       _BIT_ACCESS(PSMC2FFA,1)
// PSMC2FFA<PSMC2FFA2>
extern volatile __bit                   PSMC2FFA2           __at(0x426A);	// @ (0x84D * 8 + 2)
#define                                 PSMC2FFA2_bit       _BIT_ACCESS(PSMC2FFA,2)
// PSMC2FFA<PSMC2FFA3>
extern volatile __bit                   PSMC2FFA3           __at(0x426B);	// @ (0x84D * 8 + 3)
#define                                 PSMC2FFA3_bit       _BIT_ACCESS(PSMC2FFA,3)
// PSMC2CON<PSMC2LD>
extern volatile __bit                   PSMC2LD             __at(0x418E);	// @ (0x831 * 8 + 6)
#define                                 PSMC2LD_bit         _BIT_ACCESS(PSMC2CON,6)
// PSMC2PHL<PSMC2PH0>
extern volatile __bit                   PSMC2PH0            __at(0x4208);	// @ (0x841 * 8 + 0)
#define                                 PSMC2PH0_bit        _BIT_ACCESS(PSMC2PHL,0)
// PSMC2PHL<PSMC2PH1>
extern volatile __bit                   PSMC2PH1            __at(0x4209);	// @ (0x841 * 8 + 1)
#define                                 PSMC2PH1_bit        _BIT_ACCESS(PSMC2PHL,1)
// PSMC2PHH<PSMC2PH10>
extern volatile __bit                   PSMC2PH10           __at(0x4212);	// @ (0x842 * 8 + 2)
#define                                 PSMC2PH10_bit       _BIT_ACCESS(PSMC2PHH,2)
// PSMC2PHH<PSMC2PH11>
extern volatile __bit                   PSMC2PH11           __at(0x4213);	// @ (0x842 * 8 + 3)
#define                                 PSMC2PH11_bit       _BIT_ACCESS(PSMC2PHH,3)
// PSMC2PHH<PSMC2PH12>
extern volatile __bit                   PSMC2PH12           __at(0x4214);	// @ (0x842 * 8 + 4)
#define                                 PSMC2PH12_bit       _BIT_ACCESS(PSMC2PHH,4)
// PSMC2PHH<PSMC2PH13>
extern volatile __bit                   PSMC2PH13           __at(0x4215);	// @ (0x842 * 8 + 5)
#define                                 PSMC2PH13_bit       _BIT_ACCESS(PSMC2PHH,5)
// PSMC2PHH<PSMC2PH14>
extern volatile __bit                   PSMC2PH14           __at(0x4216);	// @ (0x842 * 8 + 6)
#define                                 PSMC2PH14_bit       _BIT_ACCESS(PSMC2PHH,6)
// PSMC2PHH<PSMC2PH15>
extern volatile __bit                   PSMC2PH15           __at(0x4217);	// @ (0x842 * 8 + 7)
#define                                 PSMC2PH15_bit       _BIT_ACCESS(PSMC2PHH,7)
// PSMC2PHL<PSMC2PH2>
extern volatile __bit                   PSMC2PH2            __at(0x420A);	// @ (0x841 * 8 + 2)
#define                                 PSMC2PH2_bit        _BIT_ACCESS(PSMC2PHL,2)
// PSMC2PHL<PSMC2PH3>
extern volatile __bit                   PSMC2PH3            __at(0x420B);	// @ (0x841 * 8 + 3)
#define                                 PSMC2PH3_bit        _BIT_ACCESS(PSMC2PHL,3)
// PSMC2PHL<PSMC2PH4>
extern volatile __bit                   PSMC2PH4            __at(0x420C);	// @ (0x841 * 8 + 4)
#define                                 PSMC2PH4_bit        _BIT_ACCESS(PSMC2PHL,4)
// PSMC2PHL<PSMC2PH5>
extern volatile __bit                   PSMC2PH5            __at(0x420D);	// @ (0x841 * 8 + 5)
#define                                 PSMC2PH5_bit        _BIT_ACCESS(PSMC2PHL,5)
// PSMC2PHL<PSMC2PH6>
extern volatile __bit                   PSMC2PH6            __at(0x420E);	// @ (0x841 * 8 + 6)
#define                                 PSMC2PH6_bit        _BIT_ACCESS(PSMC2PHL,6)
// PSMC2PHL<PSMC2PH7>
extern volatile __bit                   PSMC2PH7            __at(0x420F);	// @ (0x841 * 8 + 7)
#define                                 PSMC2PH7_bit        _BIT_ACCESS(PSMC2PHL,7)
// PSMC2PHH<PSMC2PH8>
extern volatile __bit                   PSMC2PH8            __at(0x4210);	// @ (0x842 * 8 + 0)
#define                                 PSMC2PH8_bit        _BIT_ACCESS(PSMC2PHH,0)
// PSMC2PHH<PSMC2PH9>
extern volatile __bit                   PSMC2PH9            __at(0x4211);	// @ (0x842 * 8 + 1)
#define                                 PSMC2PH9_bit        _BIT_ACCESS(PSMC2PHH,1)
// PSMC2PRL<PSMC2PR0>
extern volatile __bit                   PSMC2PR0            __at(0x4228);	// @ (0x845 * 8 + 0)
#define                                 PSMC2PR0_bit        _BIT_ACCESS(PSMC2PRL,0)
// PSMC2PRL<PSMC2PR1>
extern volatile __bit                   PSMC2PR1            __at(0x4229);	// @ (0x845 * 8 + 1)
#define                                 PSMC2PR1_bit        _BIT_ACCESS(PSMC2PRL,1)
// PSMC2PRH<PSMC2PR10>
extern volatile __bit                   PSMC2PR10           __at(0x4232);	// @ (0x846 * 8 + 2)
#define                                 PSMC2PR10_bit       _BIT_ACCESS(PSMC2PRH,2)
// PSMC2PRH<PSMC2PR11>
extern volatile __bit                   PSMC2PR11           __at(0x4233);	// @ (0x846 * 8 + 3)
#define                                 PSMC2PR11_bit       _BIT_ACCESS(PSMC2PRH,3)
// PSMC2PRH<PSMC2PR12>
extern volatile __bit                   PSMC2PR12           __at(0x4234);	// @ (0x846 * 8 + 4)
#define                                 PSMC2PR12_bit       _BIT_ACCESS(PSMC2PRH,4)
// PSMC2PRH<PSMC2PR13>
extern volatile __bit                   PSMC2PR13           __at(0x4235);	// @ (0x846 * 8 + 5)
#define                                 PSMC2PR13_bit       _BIT_ACCESS(PSMC2PRH,5)
// PSMC2PRH<PSMC2PR14>
extern volatile __bit                   PSMC2PR14           __at(0x4236);	// @ (0x846 * 8 + 6)
#define                                 PSMC2PR14_bit       _BIT_ACCESS(PSMC2PRH,6)
// PSMC2PRH<PSMC2PR15>
extern volatile __bit                   PSMC2PR15           __at(0x4237);	// @ (0x846 * 8 + 7)
#define                                 PSMC2PR15_bit       _BIT_ACCESS(PSMC2PRH,7)
// PSMC2PRL<PSMC2PR2>
extern volatile __bit                   PSMC2PR2            __at(0x422A);	// @ (0x845 * 8 + 2)
#define                                 PSMC2PR2_bit        _BIT_ACCESS(PSMC2PRL,2)
// PSMC2PRL<PSMC2PR3>
extern volatile __bit                   PSMC2PR3            __at(0x422B);	// @ (0x845 * 8 + 3)
#define                                 PSMC2PR3_bit        _BIT_ACCESS(PSMC2PRL,3)
// PSMC2PRL<PSMC2PR4>
extern volatile __bit                   PSMC2PR4            __at(0x422C);	// @ (0x845 * 8 + 4)
#define                                 PSMC2PR4_bit        _BIT_ACCESS(PSMC2PRL,4)
// PSMC2PRL<PSMC2PR5>
extern volatile __bit                   PSMC2PR5            __at(0x422D);	// @ (0x845 * 8 + 5)
#define                                 PSMC2PR5_bit        _BIT_ACCESS(PSMC2PRL,5)
// PSMC2PRL<PSMC2PR6>
extern volatile __bit                   PSMC2PR6            __at(0x422E);	// @ (0x845 * 8 + 6)
#define                                 PSMC2PR6_bit        _BIT_ACCESS(PSMC2PRL,6)
// PSMC2PRL<PSMC2PR7>
extern volatile __bit                   PSMC2PR7            __at(0x422F);	// @ (0x845 * 8 + 7)
#define                                 PSMC2PR7_bit        _BIT_ACCESS(PSMC2PRL,7)
// PSMC2PRH<PSMC2PR8>
extern volatile __bit                   PSMC2PR8            __at(0x4230);	// @ (0x846 * 8 + 0)
#define                                 PSMC2PR8_bit        _BIT_ACCESS(PSMC2PRH,0)
// PSMC2PRH<PSMC2PR9>
extern volatile __bit                   PSMC2PR9            __at(0x4231);	// @ (0x846 * 8 + 1)
#define                                 PSMC2PR9_bit        _BIT_ACCESS(PSMC2PRH,1)
// PIE4<PSMC2SIE>
extern volatile __bit                   PSMC2SIE            __at(0x4A1);	// @ (0x94 * 8 + 1)
#define                                 PSMC2SIE_bit        _BIT_ACCESS(PIE4,1)
// PIR4<PSMC2SIF>
extern volatile __bit                   PSMC2SIF            __at(0xA1);	// @ (0x14 * 8 + 1)
#define                                 PSMC2SIF_bit        _BIT_ACCESS(PIR4,1)
// PIE4<PSMC2TIE>
extern volatile __bit                   PSMC2TIE            __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 PSMC2TIE_bit        _BIT_ACCESS(PIE4,5)
// PIR4<PSMC2TIF>
extern volatile __bit                   PSMC2TIF            __at(0xA5);	// @ (0x14 * 8 + 5)
#define                                 PSMC2TIF_bit        _BIT_ACCESS(PIR4,5)
// PSMC2TMRL<PSMC2TMR0>
